Repository: Scille/parsec-cloud
Catalog: docs/locale/*/LC_MESSAGES/hosting/maintenance/backup_restore.po
Languages: fr

source: Backup and restore
fr: Sauvegarde et restauration

source: This section assumes that you deployed Parsec following the instructions from :ref:`Server deployment section <doc_hosting_deployment>`. If you deployed Parsec differently, you might need to adapt this section to your custom deployment.
fr: Cette section suppose que vous avez déployé Parsec en suivant les instructions de la :ref:`section déploiement du serveur<doc_hosting_deployment>`. Si vous avez déployé Parsec différemment, vous devrez peut-être adapter cette section à votre déploiement personnalisé.

source: Notes on consistency
fr: Notes sur la cohérence de données

source: User data, stored in the S3 object storage, is accessible thanks to the metadata stored on the PostgreSQL database. Metadata contains references to file blocks stored in the object storage.
fr: Les données de l'utilisateur, stockées dans le stockage d'objets S3, sont accessibles grâce aux métadonnées stockées dans la base de données PostgreSQL. Les métadonnées contiennent des références à des blocs de fichiers stockés dans le stockage d'objets.

source: During backup and restore, the following situations may occur:
fr: Pendant la sauvegarde et la restauration, les situations suivantes peuvent se produire :

source: The SQL database is up to date, but some objects are missing in the S3 object storage: this means that some files listed in the metadata may be missing some objects. Parsec will consider it a *file corruption* (only for files with missing objects). The affected files will still be displayed on the application, but they cannot be downloaded or opened.
fr: La base de données SQL est à jour, mais certains objets manquent dans le stockage d'objets S3 : cela signifie que certains fichiers répertoriés dans les métadonnées peuvent manquer d'objets. Parsec considérera qu'il s'agit d'une *corruption de fichier* (uniquement pour les fichiers avec des objets manquants). Les fichiers concernés seront toujours affichés dans l'application, mais ils ne pourront pas être téléchargés ou ouverts.

source: The SQL database is not up to date, but all objects are present: this means that there will be some objects that are not referenced by any file. Non-referenced objects are considered *orphaned* and therefore will be ignored by Parsec. All files displayed on the application will still be accessible.
fr: La base de données SQL n'est pas à jour, mais tous les objets sont présents : cela signifie que certains objets ne sont référencés par aucun fichier. Les objets non référencés sont considérés comme *orphelins* et seront donc ignorés par Parsec. Tous les fichiers affichés sur l'application restent accessibles.

source: The SQL database is not up to date and some objects are not referenced: In this scenario, the effect of the previous two points are cumulative.
fr: La base de données SQL n'est pas à jour et certains objets ne sont pas référencés : Dans ce scénario, les effets des deux points précédents sont cumulatifs.

source: It should be noted that no block is deleted or modified from object storage, even in the case of deleting a file or folder for historical purposes.
fr: Il convient de noter qu'aucun bloc n'est supprimé ou modifié du stockage d'objets, même dans le cas de la suppression d'un fichier ou d'un dossier à des fins historiques.

source: To maintain data consistency between databases, it is therefore necessary to **back up the SQL database before backing up the object database**, since excess objects have no consequences. The backup date to be considered is that of the SQL database.
fr: Pour maintenir la cohérence des données entre les bases, il est donc nécessaire de **sauvegarder la base de données SQL avant de sauvegarder la base de données objet**, car les objets en trop n'ont pas de conséquences. La date de sauvegarde à considérer est celle de la base de données SQL.

source: In conclusion, it is not necessary to guarantee exact consistency between the databases, as the SQL database is the authoritative source, but it is only required that the SQL database backup is earlier than the backup of the object database.
fr: En conclusion, il n'est pas nécessaire de garantir une cohérence exacte entre les bases de données, puisque la base de données SQL est la source faisant autorité, mais il est seulement nécessaire que la sauvegarde de la base de données SQL soit antérieure à la sauvegarde de la base de données objet.

source: PostgreSQL database
fr: Base de données PostgreSQL

source: Before starting, make sure you have the necessary permissions to perform these operations and that the PostgreSQL service is running. If you encounter any errors, check the error messages for clues as to what might be going wrong.
fr: Avant de commencer, assurez-vous que vous disposez des autorisations nécessaires pour effectuer ces opérations et que le service PostgreSQL est en cours d'exécution. Si vous rencontrez des erreurs, vérifiez les messages d'erreur pour savoir ce qui ne va pas.

source: Backing up the database
fr: Sauvegarde de la base de données

source: You can create a backup file of the database using ``pg_dump``.
fr: Vous pouvez créer un fichier de sauvegarde de la base de données en utilisant `pg_dump``.

source: Open a terminal or command prompt and run the following command:
fr: Ouvrez un terminal ou une invite de commande et exécutez la commande suivante :

source: Replacing:
fr: Remplacement :

source: ``$USER``: your PostgreSQL username
fr: ``$USER``: votre nom d'utilisateur PostgreSQL

source: ``$HOST``: the address of the database host (use ``localhost`` if the database is on your computer)
fr: ``$HOST`` : l'adresse de l'hôte de la base de données (utilisez ``localhost`` si la base de données est sur votre ordinateur)

source: ``$PORT``: the port on which PostgreSQL listens (by default, this is usually port ``5432``)
fr: ``$PORT`` : le port sur lequel PostgreSQL écoute (par défaut, c'est généralement le port ``5432``)

source: ``$DATABASE_NAME``: the name of the database
fr: ``$DATABASE_NAME`` : le nom de la base de données

source: If your database has a password, you will be prompted to enter it.
fr: Si votre base de données a un mot de passe, vous serez invité à le saisir.

source: The above command creates a file ``backup.sql`` which contains all the data and structure of the SQL database.
fr: La commande ci-dessus crée un fichier ``backup.sql`` qui contient toutes les données et la structure de la base de données SQL.

source: Restoring the database
fr: Restauration de la base de données

source: To restore the database from the backup file, you must first ensure that the target database exists. If it doesn't, create it with PostgreSQL.
fr: Pour restaurer la base de données à partir du fichier de sauvegarde, vous devez d'abord vous assurer que la base de données cible existe. Si ce n'est pas le cas, créez-la avec PostgreSQL.

source: Database creation (if needed)
fr: Création d'une base de données (si nécessaire)

source: Database restore
fr: Restauration de la base de données

source: If the target database exists, you can restore the database with the backup file with a single command depending on the format of the backup: use ``psql`` for SQL files or ``pg_restore`` for binary files.
fr: Si la base de données cible existe, vous pouvez restaurer la base de données avec le fichier de sauvegarde avec une seule commande en fonction du format de la sauvegarde : utilisez ``psql`` pour les fichiers SQL ou ``pg_restore`` pour les fichiers binaires.

source: For an SQL file, as described in the previous section, use:
fr: Pour un fichier SQL, comme décrit dans la section précédente, utilisez :

source: For a binary file (if you used ``pg_dump`` with ``-Fc`` option), use:
fr: Pour un fichier binaire (si vous avez utilisé ``pg_dump`` avec l'option ``-Fc``), utilisez :

source: Object storage (S3)
fr: Stockage d'objets (S3)

source: This section covers S3 object storage backup and restore in AWS.
fr: Cette section traite de la sauvegarde et de la restauration du stockage d'objets S3 dans AWS.

source: Before starting, make sure your AWS account has the necessary permissions to access the S3 bucket and perform these operations.
fr: Avant de commencer, assurez-vous que votre compte AWS dispose des autorisations nécessaires pour accéder au seau S3 et effectuer ces opérations.

source: Backing up the bucket
fr: Sauvegarde du bucket

source: Use ``aws`` to manage buckets compatible with Amazon's S3 service.
fr: Utilisez ``aws`` pour gérer les buckets compatibles avec le service S3 d'Amazon.

source: Synchronize the S3 bucket with a local directory:
fr: Synchroniser le bucket S3 avec un répertoire local :

source: Where:
fr: Où:

source: ``s3://bucket_name`` is the path to the S3 bucket
fr: `s`3://nom_du_bucket`` est le chemin vers le bucket S3

source: ``/path/local/backup`` is the path to the local directory where you want to store the backup
fr: ``/path/local/backup`` est le chemin vers le répertoire local où vous voulez stocker la sauvegarde

source: This command will download all files in the "bucket_name" bucket to the local directory specified.
fr: Cette commande permet de télécharger tous les fichiers du bucket « bucket_name » dans le répertoire local spécifié.

source: Restoring the bucket
fr: Restauration du bucket

source: Restore all objects to an S3 bucket
fr: Restaurer tous les objets dans un bucket S3

source: To restore data from backup, use the ``aws s3 sync`` command in the opposite direction, i.e. from the local directory to the S3 bucket.
fr: Pour restaurer des données à partir d'une sauvegarde, utilisez la commande ``aws s3 sync`` dans la direction opposée, c'est-à-dire du répertoire local vers le bucket S3.

source: ``/path/local/backup`` is the path to the local directory where you stored the backup.
fr: ``/path/local/backup`` est le chemin vers le répertoire local où vous avez stocké la sauvegarde.

source: This command will send all files in the specified local directory to the "bucket_name" bucket.
fr: Cette commande enverra tous les fichiers du répertoire local spécifié dans le bucket « bucket_name ».

source: **Incremental backup**: ``aws s3 sync`` is smart enough to copy only those files that have been modified. This makes subsequent backups faster after the first full backup.
fr: **Sauvegarde incrémentale** : ``aws s3 sync`` est suffisamment intelligent pour ne copier que les fichiers qui ont été modifiés. Cela rend les sauvegardes suivantes plus rapides après la première sauvegarde complète.
