Repository: Scille/parsec-cloud
Catalog: docs/locale/*/LC_MESSAGES/hosting/maintenance/upgrade_downgrade.po
Languages: fr

source: This section assumes that you deployed Parsec following the instructions from :ref:`Server deployment section <doc_hosting_deployment>`. If you deployed Parsec differently, you might need to adapt this section to your custom deployment.
fr: Cette section suppose que vous avez déployé Parsec en suivant les instructions de :ref:`Server deployment section <doc_hosting_deployment>`. Si vous avez déployé Parsec différemment, vous devrez peut-être adapter cette section à votre déploiement personnalisé.

source: Upgrade Parsec Server
fr: Mise à jour du serveur Parsec

source: Before upgrading, make sure to back up the database as explained in the, :ref:`Backup and Restore section <doc_hosting_maintenance_backup_restore>` in case you need to roll back the update.
fr: Avant de procéder à la mise à jour, assurez-vous de sauvegarder la base de données comme expliqué dans la section, :ref:`Sauvegarde et restauration <doc_hosting_maintenance_backup_restore>` au cas où vous auriez besoin de revenir sur la mise à jour.

source: In this guide, we will migrate ``parsec-server`` from version ``v3.0.0`` to ``v3.1.0``.
fr: Dans ce guide, nous allons migrer ``parsec-server`` de la version ``v3.0.0`` vers ``v3.1.0``.

source: Update the ``parsec-server``'s docker image tag of in docker-compose file (``parsec-server.docker.yaml``):
fr: Mettre à jour le tag docker image de ``parsec-server`` dans le fichier docker-compose (``parsec-server.docker.yaml`) :

source: You need to change the used tag (at line **5**) to ``v3.1.0``.
fr: Vous devez changer la balise utilisée (à la ligne **5**) en ``v3.1.0``.

source: List the pending migrations to be applied:
fr: Liste des migrations en attente à appliquer :

source: The output should look like this:
fr: Le résultat devrait ressembler à ceci :

source: This output is provided as an example. Don't expect it to match your output.
fr: Ce résultat est fourni à titre d'exemple. Ne vous attendez pas à ce qu'elle corresponde à la vôtre.

source: The lines ending with ``already applied`` are migrations already present on the database whereas the one ending with ``✔`` are migrations to be applied.
fr: Les lignes se terminant par ``already applied`` sont des migrations déjà présentes dans la base de données tandis que celles se terminant par ``✔`` sont des migrations à appliquer.

source: Apply the database migration:
fr: Appliquer la migration de la base de données :

source: Restart the ``parsec-server`` container:
fr: Redémarrer le conteneur ``parsec-server`` :

source: Downgrade Parsec Server
fr: Rétablir une version antérieure du serveur Parsec

source: Rollback is currently limited in Parsec. The only possible way to rollback is to use the previous database backup. So you will lose the delta of backup vs current database.
fr: Le retour en arrière est actuellement limité dans Parsec. La seule façon de revenir en arrière est d'utiliser la sauvegarde de la base de données précédente. Vous perdrez donc le delta entre la sauvegarde et la base de données actuelle.

source: To roll back to a previous version, let's say we want to downgrade ``parsec-server`` from version ``v3.1.0`` to ``v3.0.0``.
fr: Pour revenir à une version antérieure, disons que nous voulons rétrograder ``parsec-server`` de la version ``v3.1.0`` à ``v3.0.0``.

source: Downgrade the ``parsec-server``'s docker image tag in the docker-compose file (``parsec-server.docker.yaml``). Like in :ref:`Update the parsec-server tag <update_docker_image_tag>` change the tag ``v3.1.0`` to ``v3.0.0``.
fr: Rétrogradez le tag docker image de ``parsec-server`` dans le fichier docker-compose (``parsec-server.docker.yaml`). Comme dans :ref:`Mettre à jour le tag parsec-server <update_docker_image_tag>` changer le tag ``v3.1.0`` en ``v3.0.0``.

source: Replace the current database with the backup on the Postgres database.
fr: Remplacer la base de données actuelle par la sauvegarde de la base de données Postgres.

source: :ref:`Restart the parsec-server container<restart_parsec_server_container>`
fr: :ref:`Redémarrer le conteneur du serveur Parsec<restart_parsec_server_container>`
