Repository: Scille/parsec-cloud
Catalog: docs/locale/*/LC_MESSAGES/hosting/custom_branding.po
Languages: fr

source: Parsec customization
fr: Personnalisation de Parsec

source: Parsec application can be partially customized to better fit your brand.
fr: L'application Parsec peut être partiellement personnalisée pour mieux correspondre à votre marque.

source: Customization is done by adding specific files in certain locations. If Parsec detects the presence of these files, it will use them instead of the regular ones.
fr: La personnalisation se fait en ajoutant des fichiers spécifiques à certains emplacements. Si Parsec détecte la présence de ces fichiers, il les utilisera à la place des fichiers habituels.

source: In web mode, the files have to be placed inside a ``custom`` folder in the server's static files directory. A file should be reachable by doing ``/custom/<file>`` on the server.
fr: En mode web, les fichiers doivent être placés dans un dossier ``custom`` dans le répertoire de fichiers statiques du serveur. Un fichier doit être accessible via ``/custom/<file>`` sur le serveur.

source: In desktop mode, the files have to be placed inside a ``custom`` folder in the configuration directory. The configuration directory will depend on the OS.
fr: En mode bureau, les fichiers doivent être placés dans un dossier ``custom`` dans le répertoire de configuration. Le répertoire de configuration dépendra du système d'exploitation.

source: The following images can be customized at the moment:
fr: Les images suivantes peuvent être personnalisées pour le moment :

source: ``logo.svg``: the logo displayed in the bottom left corner of the home page.
fr: ``logo.svg`` : le logo affiché dans le coin inférieur gauche de la page d'accueil.

source: ``logo_icon.svg``: the icon version of the logo, it will be used for your organizations.
fr: ``logo_icon.svg`` : la version icône du logo, elle sera utilisée pour vos organisations.

source: ``home_sidebar.png``: the image displayed in the home page sidebar.
fr: ``home_sidebar.png`` : l'image affichée sur la barre latérale de la page d'accueil.

source: Specifically for the desktop app on ``Linux`` and ``Windows``, you may also add:
fr: Spécifiquement pour l'application de bureau sur ``Linux`` et ``Windows``, vous pouvez également ajouter :

source: ``app_icon.png``: the icon displayed in the taskbar and window title.
fr: ``app_icon.png`` : l'icône affichée dans la barre des tâches ou dans le titre de la fenêtre.

source: ``tray_icon.png``: the icon displayed in the system tray or notification area.
fr: ``tray_icon.png`` : l'icône affichée dans la barre d'état système ou de notifications.

source: ``splash.png``: the splash screen image. We recommend you match the size of the original splash screen, which is 624x424.
fr: ``splash.png`` : l'écran de démarrage de l'application. Nous vous recommandons de respecter la taille de l'écran de démarrage original, qui est de 624x424.

source: The image type and file extension matter. If you use a different type, Parsec may not be able to load it.
fr: Le type d'image et l'extension de fichier sont importants. Si vous utilisez un type différent, Parsec ne pourra peut-être pas le charger.

source: We recommend that you check how your images are displayed in Parsec using different display resolutions. Some images may look great on your screen, but completely off on another. If you use the recommended sizes when mentioned, you shouldn't have any problem.
fr: Nous vous recommandons de vérifier l'application avec différentes résolutions d'affichage, car certaines images peuvent sembler parfaites sur votre écran, mais complètement décalées sur un autre. Si vous utilisez les tailles recommandées lorsqu'elles sont mentionnées, vous ne devriez pas rencontrer de problème.

source: Texts
fr: Textes

source: You can also customize some specific texts in Parsec. To do so, simply:
fr: Vous pouvez également personnaliser certains textes dans Parsec. Pour ce faire :

source: Copy the following ``.json`` code excerpts to ``custom_en-US.json`` and ``custom_fr-FR.json`` files
fr: Copiez les extraits ``.json`` ci-après dans des fichiers ``custom_en-US.json`` et ``custom_fr-FR.json`` respectivement

source: Edit the original text values (but not the keys)
fr: Éditez les textes originaux (mais pas les clefs)

source: Put both files in the same ``custom`` folder as before
fr: Mettez les deux fichiers ainsi modifiés dans le même dossier ``custom`` que précédemment.

source: Server emails & HTML pages
fr: Emails et pages HTML du serveur

source: Parsec server emails and HTML pages (index, 404) are based on the `Jinja template syntax`_.
fr: Les courriels du serveur Parsec et les pages HTML (index, 404) sont basés sur `la syntaxe de template Jinja <Jinja template syntax_>`_.

source: You can customize them by providing a custom template directory when running the server with ``--template-dir`` or by setting the environment variable ``PARSEC_TEMPLATE_DIR``.
fr: Vous pouvez les personnaliser en fournissant un répertoire de modèles personnalisé lors de l'exécution du serveur avec ``--template-dir`` ou en définissant la variable d'environnement ``PARSEC_TEMPLATE_DIR``.

source: The directory should contain the following files:
fr: Le dossier doit contenir les fichiers suivants :

source: ``index.html``: default landing page when you access the server.
fr: ``index.html`` : page d'accueil par défaut lorsque vous accédez au serveur.

source: ``404.html``: resource not found page.
fr: ``404.html`` : page de ressource non trouvée.

source: ``email/account_create.[html|txt].j2``: HTML and TEXT templates for the email send to confirm Parsec account creation.
fr: ``email/account_create.[html|txt].j2`` : Modèles HTML et TEXTE pour le courriel envoyé afin de confirmer la création d'un compte Parsec.

source: ``email/account_delete.[html|txt].j2``: HTML and TEXT email templates to confirm Parsec account deletion.
fr: ``email/account_delete.[html|txt].j2``: Modèles d'e-mail HTML et TEXTE pour confirmer la suppression du compte Parsec.

source: ``email/account_recover.[html|txt].j2``: HTML and TEXT email templates to confirm Parsec account recovery.
fr: ``email/account_recover.[html|txt].j2`` : modèles d'e-mails HTML et TEXTE pour confirmer la récupération du compte Parsec.

source: ``email/invitation.[html|txt].j2``: HTML and TEXT email templates to send invitation to join an organization.
fr: ``email/invitation.[html|txt].j2`` : modèles d'e-mails HTML et TEXTE pour envoyer une invitation à rejoindre une organisation.

source: You can base your customization on the default server's templates `found here <parsec-server-template-src_>`_.
fr: Vous pouvez baser votre personnalisation sur les modèles du serveur par défaut `disponibles ici <parsec-server-template-src_>`_.
