Repository: Scille/parsec-cloud
Catalog: docs/locale/*/LC_MESSAGES/hosting/sequester/index.po
Languages: fr

source: Sequester service
fr: Service du Séquestre

source: The sequester service allows to recover all data from an organization. It can only be activated during the organization bootstrap and not afterwards.
fr: Le service de séquestre permet de récupérer toutes les données d'une organisation. Il ne peut être activé que lors du démarrage de l'organisation et non après.

source: The typical use case for this service is to respond to an investigation carried out by an inspection service requiring access to data stored on the workspaces of the person(s) involved in the investigation.
fr: Le cas d'utilisation typique de ce service est la réponse à une enquête menée par un service d'inspection nécessitant l'accès aux données stockées sur les espaces de travail de la (des) personne(s) impliquée(s) dans l'enquête.

source: The service is managed by an *authority key* and a *service key*. Note that the secret parts of both authority and service keys are only used in an off-line mode (i.e. no direct communication with the Parsec server is required), so that they can be stored in a secure location.
fr: Le service est géré par une *clé d'autorité* et une *clé de service*. Notez que les parties secrètes des clés d'autorité et de service ne sont utilisées qu'en mode hors ligne (c'est-à-dire qu'aucune communication directe avec le serveur Parsec n'est nécessaire), de sorte qu'elles peuvent être stockées dans un endroit sûr.

source: The environment in which the sequester service is used can be controlled as much as possible.
fr: L'environnement dans lequel le service de séquestre est utilisé peut être contrôlé autant que possible.

source: Security considerations
fr: Considérations de sécurité

source: The sequester service uses AES-256 keys which are the most sensitive elements because they are used to decrypt the exported data.
fr: Le service de séquestre utilise des clés AES-256 qui sont les éléments les plus sensibles car elles sont utilisées pour décrypter les données exportées.

source: These keys must therefore be backed up and stored on a physically protected external medium (safe) and all decryption operations must be carried out on an off-line workstation.
fr: Ces clés doivent donc être sauvegardées et stockées sur un support externe physiquement protégé (coffre-fort) et toutes les opérations de décryptage doivent être effectuées sur un poste de travail hors ligne.

source: Requirements
fr: Prérequis

source: In order to use the Sequester service you need:
fr: Pour utiliser le service de séquestre, vous devez :

source: OpenSSL, for key generation
fr: OpenSSL, pour la génération de clés

source: Parsec server CLI (from pypi `pip install parsec-cloud`)
fr: CLI du serveur Parsec (from pypi `pip install parsec-cloud`)

source: Authority key
fr: Clé d'autorité

source: You can create the authority key with the following commands:
fr: Vous pouvez créer la clé d'autorité à l'aide des commandes suivantes :

source: Create and bootstrap organization with sequester authority
fr: Création et démarrage d'une organisation avec l'autorité de séquestre

source: Sequester service key and certificate
fr: Séquestrer la clé de service et le certificat

source: You can create the service key and certificate with the following commands:
fr: Vous pouvez créer la clé de service et le certificat à l'aide des commandes suivantes :

source: Enable sequester service
fr: Activer le service de séquestre

source: Exporting data with sequester service
fr: Exportation de données avec le service séquestre

source: Realm vs Workspace: In Parsec vocabulary, workspace and realm are two sides of the same coin. In a nutshell, the realm is a server-side concept that references the big pile of encrypted data, while the workspace is the client-side concept that references those data once decrypted.
fr: Realm vs Espace de travail : Dans le vocabulaire Parsec, Espace de travail et Realm sont les deux faces d'une même pièce. En résumé, le realm est un concept côté serveur qui fait référence à la grosse pile de données cryptées, tandis que l'espace de travail est le concept côté client qui fait référence à ces données une fois décryptées.

source: Hence the "realm export" is the operation of exporting from the server all the encrypted data that, when used with the right decryption keys, will allow us to have a full read access on a workspace at any point in time up to the export date.
fr: Par conséquent, l'« exportation de realm » est l'opération qui consiste à exporter du serveur toutes les données cryptées qui, lorsqu'elles sont utilisées avec les bonnes clés de décryptage, nous permettent d'avoir un accès en lecture complet à un espace de travail à tout moment jusqu'à la date d'exportation.

source: Overview:
fr: Vue d'ensemble :

source: An organization exists with a workspace
fr: Une organisation existe avec un espace de travail

source: From the server CLI, a realm is exported. This generates a large `.sqlite` file containing all encrypted data belonging to this realm.
fr: Un realm est exporté à l'aide de l'interface CLI du serveur. Cela génère un grand fichier `.sqlite` contenant toutes les données cryptées appartenant à ce realm.

source: The realm export file is transferred to a machine containing the decryption keys:
fr: Le fichier d'exportation du realm est transféré vers une machine contenant les clés de décryptage :

source: Sequestered service key in case of a sequestered organization.
fr: Clé de service du séquestre dans le cas d'une organisation séquestrée.

source: Device key otherwise (i.e. decrypt the realm export from a machine normally used to run the Parsec client).
fr: Clé de l'appareil, sinon (c'est-à-dire décrypter l'exportation du realm à partir d'une machine normalement utilisée pour exécuter le client Parsec).

source: Using exported data
fr: Utilisation des données exportées
