Repository: Scille/parsec-cloud
Catalog: docs/locale/*/LC_MESSAGES/hosting/administration/shared_recovery.po
Languages: fr

source: Shared recovery
fr: Récupération partagée

source: This section describes an advanced function that is currently only available via Parsec CLI. For a user friendly way to recover access to your organization see :ref:`Recovery files<doc_userguide_recovery_files>`.
fr: Cette section décrit une fonction avancée qui n'est actuellement disponible que via le CLI de Parsec. Pour une méthode conviviale de récupération de l'accès à votre organisation, voir :ref:`Fichiers de récupération<doc_guide_utilisateur_fichiers_de_récupération>`.

source: The shared recovery allows a user to recover access to their organization by distributing the information required to recover their account (the "secret") among a group of users of the organization. The information is divided into parts (the "shares") from which the secret can be reassembled only when quorum is achieved, i.e. a sufficient number of shares (the "threshold") are combined, therefore enabling the recovery of the user account.
fr: La récupération partagée permet à un utilisateur de récupérer l'accès à son organisation en distribuant les informations nécessaires à la récupération de son compte (le « secret ») parmi un groupe d'utilisateurs de l'organisation. Les informations sont divisées en parties (les « parts ») à partir desquelles le secret ne peut être reconstitué que lorsque le quorum est atteint, c'est-à-dire lorsqu'un nombre suffisant de parts (le « seuil ») sont combinées, ce qui permet de récupérer le compte de l'utilisateur.

source: This is based on *Shamir's secret sharing algorithm*. The idea is that even if an attacker steals some shares, it is impossible for the attacker to reconstruct the secret unless they have stolen the quorum number of shares.
fr: Il est basé sur *l'algorithme de partage de clé secrète de Shamir*. L'idée est que même si un attaquant vole quelques parts, il lui est impossible de reconstituer le secret s'il n'a pas volé le nombre de parts correspondant au quorum.

source: Overview
fr: Vue d'ensemble

source: The shared recovery process involves the following steps:
fr: Le processus de récupération partagée comprend les étapes suivantes :

source: the user creates a shared recovery setup by choosing
fr: l'utilisateur crée une configuration de récupération partagée en choisissant

source: the list of users to send shares (*recipients*)
fr: la liste des utilisateurs à qui envoyer des actions (*recipients*)

source: the number of shares for each recipient (*weight*)
fr: le nombre d'actions pour chaque bénéficiaire (*weight*)

source: the number of shares required to recover the account (*threshold*)
fr: le nombre d'actions nécessaires pour récupérer le compte (*threshold*)

source: any of the recipient sends an invitation to the user to recover their account
fr: l'un des destinataires envoie une invitation à l'utilisateur pour qu'il récupère son compte

source: the user contacts the recipients one by one until the threshold is reached
fr: l'utilisateur contacte les destinataires un par un jusqu'à ce que le seuil soit atteint

source: The ``<DEVICE_ID>`` mentioned in the commands below always refer to the device of the user running the command (user or administrator). You can find out which is your device ID by running:
fr: Le ``<DEVICE_ID>`` mentionné dans les commandes ci-dessous fait toujours référence à l'appareil de l'utilisateur qui exécute la commande (utilisateur ou administrateur). Vous pouvez connaître l'ID de votre appareil en lançant la commande :

source: Shared recovery creation
fr: Création d'une récupération partagée

source: To setup shared recovery for a device, run the following command:
fr: Pour configurer la récupération partagée pour un périphérique, exécutez la commande suivante :

source: Run the help of this command to know all the options.
fr: Lancez l'aide de cette commande pour connaître toutes les options.

source: When no recipient is specified, all the Administrations of the organization will be recipients with a single share. Note that users with External profile are not able to choose their recipients as they do not have access to the organization user list.
fr: Si aucun destinataire n'est spécifié, tous les administrateurs de l'organisation seront destinataires d'un seul partage. Notez que les utilisateurs ayant un profil externe ne peuvent pas choisir leurs destinataires car ils n'ont pas accès à la liste des utilisateurs de l'organisation.

source: If the threshold is not specified, it will be asked interactively.
fr: Si le seuil n'est pas spécifié, il sera demandé de manière interactive.

source: Recover access with shared recovery
fr: Récupérer l'accès avec la récupération partagée

source: The shared recovery process must be initiated by one of the recipients, so the user needs to contact them and ask them for an invitation to recover their account.
fr: Le processus de récupération partagée doit être initié par l'un des destinataires. L'utilisateur doit donc le contacter et lui demander une invitation à récupérer son compte.

source: A recipient can create an invitation by using the user's email:
fr: Un destinataire peut créer une invitation en utilisant l'adresse électronique de l'utilisateur :

source: The user will receive an email with the invitation url, and will be able to claim the invitation with the following command:
fr: L'utilisateur recevra un courriel contenant l'adresse URL de l'invitation et pourra réclamer l'invitation à l'aide de la commande suivante :

source: The user will have to select recipients one by one, performing the SAS code exchange, until until enough shares have been gathered. At which point the new device is registered and access is fully recovered.
fr: L'utilisateur devra sélectionner les destinataires un par un, en procédant à l'échange de codes SAS, jusqu'à ce qu'un nombre suffisant d'actions ait été recueilli. Le nouveau dispositif est alors enregistré et l'accès est entièrement rétabli.

source: An example scenario
fr: Un scénario d'exemple

source: The following is a simple scenario to show you the shared recovery process. All commands are executed in the same machine for simplicity.
fr: Voici un scénario simple pour vous montrer le processus de récupération partagée. Pour des raisons de simplicité, toutes les commandes sont exécutées sur la même machine.

source: Given an organization with the following users:
fr: Étant donné une organisation avec les utilisateurs suivants :

source: Bob is a Member of the organization. Alice and Arnold are Administrators.
fr: Bob est membre de l'organisation. Alice et Arnold sont administrateurs.

source: First Bob needs to create their shared recovery setup.
fr: Bob doit d'abord créer sa configuration de récupération partagée.

source: All the Administrators (Alice and Arnold) are recipients, as no recipients was provided. Bob chooses interactively the threshold. So Bob's shared recovery is all setup.
fr: Tous les administrateurs (Alice et Arnold) sont des destinataires, car aucun destinataire n'a été fourni. Bob choisit interactivement le seuil. La récupération partagée de Bob est donc entièrement configurée.

source: Oh no! Bob has lost access to their device. It must contact an Alice or Arnold in order to be invited again through a shared recovery process.
fr: Oh non ! Bob a perdu l'accès à son appareil. Il doit contacter une Alice ou Arnold afin d'être invité à nouveau par le biais d'un processus de récupération partagée.

source: Alice creates the invitation and shares the URL with Bob.
fr: Alice crée l'invitation et partage l'URL avec Bob.

source: Bob can now start the invitation process.
fr: Bob peut maintenant lancer le processus d'invitation.

source: Bob must choose a person to contact first. Let's choose Alice first.
fr: Bob doit choisir une personne à contacter en premier. Choisissons d'abord Alice.

source: In the meantime, Alice must be ready to greet Bob. First, retrieve the invitation token.
fr: Entre-temps, Alice doit être prête à accueillir Bob. Tout d'abord, elle récupère le jeton d'invitation.

source: Then it can be use to greet Bob. And proceed to a SAS code exchange.
fr: Il peut ensuite être utilisé pour accueillir Bob. Et procéder à un échange de codes SAS.

source: Now Bob has one share of the two they need. So they can repeat the process with Arnold.
fr: Maintenant, Bob a une part des deux dont il a besoin. Il peut donc répéter le processus avec Arnold.

source: Once the SAS codes are exchanged, Bob can setup their new device with a label and password. And so the shared recovery process is fully completed.
fr: Une fois les codes SAS échangés, Bob peut configurer son nouvel appareil à l'aide d'une étiquette et d'un mot de passe. Le processus de récupération partagée est ainsi entièrement achevé.
