Repository: Scille/parsec-cloud
Catalog: docs/locale/*/LC_MESSAGES/architecture.po
Languages: fr

source: Overview
fr: Aperçu

source: Parsec is divided between a client (responsible for exposing data to the user and providing an encryption layer) and a server (storing the encrypted data and notifying clients about other users activity such as data modification or new sharing).
fr: Parsec est divisé en un client (responsable d'exposer les données à l'utilisateur ainsi que de gérer la couche cryptographique) et le serveur (servant à stocker les données chiffrées ainsi qu'à notifier les clients des actions des autres utilisateurs telles une modification d'un fichier ou un nouveau partage).

source: Parsec single server, multi organizations showcase
fr: Démonstration de Parsec avec un seul serveur, plusieurs organisations

source: The Parsec server only requires a PostgreSQL DB for metadata (that is encrypted using devices keys for the most part) and an Amazon S3 or OpenStack Swift object storage for data blobs (that are encrypted using Workspaces keys which never leave users’ devices). Redundancy using multiple cloud providers is possible.
fr: Le serveur Parsec ne requiert qu'une base de données PostgreSQL pour les métadonnées (qui sont chiffrées par les clés des appareils dans leur majorité) et un stockage objet Amazon S3 ou OpenStack Swift pour les blobs binaires (qui sont tous chiffrés en utilisant des clés de l'Espace de Travail, qui ne quittent pas les terminaux des utilisateurs). Il est possible de mettre en place un système de redondance avec de multiples fournisseurs de cloud différents.

source: Parsec security model
fr: Modèle de sécurité Parsec

source: Parsec secures sensitive data before they are stored on public clouds, proceeding in 3 steps :
fr: Parsec sécurise les données sensibles avant qu’elles ne soient stockées sur les clouds publics, en procédant en trois étapes :

source: Splitting of files in blocks before encryption;
fr: Découpage en blocs des fichiers avant chiffrement;

source: Encryption of each block with a different symmetric key (BLOCK_ENC_KEY);
fr: Chiffrement de chaque bloc par une clé symétrique différente (BLOCK_ENC_KEY);

source: Encryption of the metadata (tree structure, composition of files, multiple BLOCK_ENC_KEY, sharing information) with the private key of the user (USER_ENC_S_KEY).
fr: Chiffrement des métadonnées (arborescence, composition des fichiers, les BLOCK_ENC_KEY, information de partage) par la clé privée de l’utilisateur (USER_ENC_S_KEY).

source: Separation of actors
fr: Séparation des acteurs

source: User: represents a natural person in Parsec. A user owns an asymmetric key (USER_ENC_S_KEY/USER_ENC_P_KEY) enabling the encryption of data intended only for the user, like its User Manifest (see below).
fr: Utilisateur : représente une personne physique dans Parsec. Un utilisateur dispose d’une clé asymétrique (USER_ENC_S_KEY / USER_ENC_P_KEY) lui permettant de chiffrer des données uniquement pour lui tel que son User Manifest (voir ci-dessous).

source: The Workstation: the physical support -- desktop or mobile computer.
fr: Le Poste de Travail : support physique -- ordinateur fixe ou portable.

source: Device: it is through a Device that the user accesses Parsec. A user can have multiple devices (e.g. a desktop and a laptop). Each device has its own asymmetric signature key (DEVICE_SIG_S_KEY/DEVICE_SIG_P_KEY) enabling signing modifications made by itself.
fr: Terminal : c’est par l’intermédiaire d’un terminal (ou device) que l’utilisateur accède à Parsec. Chaque utilisateur a potentiellement plusieurs terminaux (ex: un pour son ordinateur fixe et un autre sur son portable). Chaque terminal possède sa propre clé asymétrique de signature (DEVICE_SIG_S_KEY / DEVICE_SIG_P_KEY) permettant de signer les modifications qu’il a réalisées.

source: Parsec data model
fr: Modèle de données Parsec

source: File Manifest: contains the file name, the list of block composing it and the associated BLOCK_ENC_KEY.
fr: File Manifest : contient le nom du fichier, la liste des blocs qui le composent et les BLOCK_ENC_KEY associées.

source: Folder Manifest: index containing a set of entries, each entry being either a File Manifest or another Folder Manifest.
fr: Folder Manifest : index qui contient un ensemble d’entrées, chaque entrée étant un File Manifest ou un autre Folder Manifest.

source: Workspace Manifest: index similar to the Folder Manifest, that can also be shared between multiple users.
fr: Workspace Manifest : index similaire au Folder Manifest, mais pouvant être partagé entre plusieurs utilisateurs.

source: User Manifest: root index of each user containing the Workspaces Manifests shared with the user.
fr: User Manifest : index racine propre à chaque utilisateur et contenant les Workspace Manifests partagés avec celui-ci.

source: Data sharing model
fr: Modèle de partage de données

source: Workspace: a set of users sharing a trust perimeter. Parsec ensures sharing sensitive data by encrypting the Workspace Key (WS_ENC_KEY) using the key of the receiver of that data (USER_ENC_P_KEY) -- this step is repeated for each receiver.
fr: Espace de Travail : un groupe d’utilisateurs partageant un même espace de confiance. Parsec effectue le partage de données sensibles via le chiffrement de la clé de workspace (WS_ENC_KEY) par la clé du destinataire du partage (USER_ENC_P_KEY) -- cette étape de chiffrement est répétée autant de fois qu’il y a de destinataires.

source: Organization: a set of Workspaces and a set of Users members of the organization. Workspace access can only be granted to members of the organization. A single Workspace cannot be shared between two distincts organizations.
fr: Organisation : un ensemble des espaces de travail et un ensemble d'utilisateurs membres de l'organisation. L'accès à un espace de travail ne peut être accordé qu'aux membres de l'organisation. Deux organisations distinctes ne peuvent pas accéder au même espace de travail.
