Repository: Scille/parsec-cloud
Catalog: docs/locale/*/LC_MESSAGES/development.po
Languages: fr

source: Development
fr: Développement

source: Get the sources
fr: Récupérer le code source

source: Source code is `available on github <https://github.com/Scille/parsec-cloud>`_.
fr: Le code du projet est `disponible sur github <https://github.com/Scille/parsec-cloud>`_.

source: You should fist clone it with ``git`` and move to the project dir::
fr: Vous devez tout d'abord le cloner avec ``git`` et aller dans le répertoire du projet::

source: Create a Python virtual environment for the project::
fr: Créer un environnement virtuel Python pour le projet::

source: Parsec requires Python >= 3.9
fr: Parsec nécessite Python >= 3.9

source: Note the ``--editable`` option, this tell the virtualenv to directly rely on the source code within the parsec-cloud directory instead of copying it into it install directory. This way you don't need to reinstall the project each time you modify something in the project source code.
fr: Notez l'option ``--editable``, sa présence est nécessaire pour directement utiliser le code présent dans le répertoire parsec-cloud au lieu de le copier dans le répertoire d'installation. De cette façon il n'est pas nécessaire de réinstaller le projet à chaque modification du code source.

source: Run the tests
fr: Lancer les tests

source: Run the tests with pytest::
fr: Les tests se lancent avec pytest::

source: On top of that, multiple options are available:
fr: En outre, plusieurs options sont disponibles :

source: Include mountpoint tests
fr: Inclus les tests du point de montage

source: Include GUI tests
fr: Inclus les tests d'interface graphique

source: Include slow tests
fr: Inclus les tests lents

source: Use PostgreSQL in the backend instead of a mock in memory
fr: Utilise PostgreSQL comme moteur de backend au lieu d'un mock en mémoire

source: Run tests in parallel
fr: Lance les tests en parallèle

source: Note you can mix&match the flags, e.g. ``py.test tests --runmountpoint --postgresql --runslow -n auto``.
fr: Notez qu'il est possible de mélanger ces options, par exemple ``py.test tests --runmountpoint --postgresql --runslow -n auto``.

source: Run Parsec in local
fr: Lancer Parsec en local

source: You can use the ``run_testenv`` scripts to easily create a development environment:
fr: Il est possible d'utiliser le script ``run_testenv`` afin de facilement créer un environnement de développement :

source: On linux::
fr: Sous linux::

source: On Windows::
fr: Sous Windows::

source: This script will:
fr: Ce script va :

source: Start a development backend server with in-memory storage
fr: Démarrer un backend de développement avec un stockage de données en mémoire

source: Configure environment variables to isolate the development environment from your global Parsec configuration
fr: Configurer les variables d'environnement pour isoler l'environnement de développement de la configuration globale de Parsec

source: Create a default organization
fr: Créer une organisation par défaut

source: Create multiple users and devices for this organization
fr: Créer plusieurs utilisateurs et terminaux pour cette organisation
