Repository: Scille/parsec-cloud
Catalog: docs/locale/*/LC_MESSAGES/hosting_server.po
Languages: fr

source: Hosting Server
fr: Héberger un serveur

source: Requirements
fr: Pré-requis

source: On top of that, an object storage service is required in order to store the encrypted data blocks. Both Amazon S3 or OpenStack Swift API are supported.
fr: En plus de cela, un service de stockage de type objet est nécessaire afin de stocker les blocs de données chiffrés. À cette fin, Amazon S3 et OpenStack Swift sont tous deux supportés.

source: Hosting
fr: Hébergement

source: Communication between client and server is achieved using `Websocket <https://tools.ietf.org/html/rfc6455>`_. This allow bidirectional communication (needed by the server to be able to notify the client of remote changes) while still relying on very well supported web standard.
fr: La communication entre client et serveur est effectuée via des `Websocket <https://tools.ietf.org/html/rfc6455>`_. Ce protocole fournit une communication bidirectionnelle (nécessaire afin que le serveur puisse notifier le client des changements) tout en s'appuyant sur des standards du web.

source: Parsec server respects the `twelve-factor app principles <https://12factor.net/>`_. Hence each server instance is stateless and disposable, making it easy to host it on PAAS infrastructures or in containers.
fr: Le serveur Parsec respecte la `philosophie des applications à 12 facteurs <https://12factor.net/>`_. De ce fait une instance du serveur ne contient pas d'état et peut être remplacée à tout moment, ce qui la rend idéale pour un hébergement sur du PAAS ou bien au sein d'une architecture à base de conteneurs.

source: In short, from a hosting point of view, Parsec server is similar to a standard web application.
fr: Au final, d'un point de vue hébergement, le serveur Parsec est similaire à une application web classique.

source: Run
fr: Démarrage

source: Use the ``parsec backend run`` command to start Parsec server, for instance:
fr: Utiliser la commande ``parsec backend run`` pour démarrer le server Parsec, par exemple:

source: Settings
fr: Paramètres

source: Settings can be specified by using environment variable ``PARSEC_CMD_ARGS``. All available command line arguments can be used and environ variables within it will be expanded. For instance:
fr: Des paramètres peuvent être spécifiés via la variable d'environnement ``PARSEC_CMD_ARGS``. Tous les paramètres pouvant être passés via la ligne de commande sont utilisables et les variables d'environnement seront développées. Par exemple::

source: Host
fr: Hôte

source: Environ: ``PARSEC_HOST``
fr: Environnement: ``PARSEC_HOST``

source: Default: ``127.0.0.1``
fr: Défaut: ``127.0.0.1``

source: Host to listen on.
fr: Host sur lequel écouter.

source: Environ: ``PARSEC_PORT``
fr: Environnement: ``PARSEC_PORT``

source: Default: ``6777``
fr: Défaut: ``6777``

source: Port to listen on.
fr: Port sur lequel écouter.

source: Database URL
fr: URL de la base de données

source: Environ: ``PARSEC_DB``
fr: Environnement: ``PARSEC_DB``

source: Database configuration.
fr: Configuration de la base de données.

source: Allowed values:
fr: Variables autorisées:

source: ``MOCKED``: Mocked in memory
fr: ``MOCKED``: Simulé en mémoire

source: ``postgresql://<...>``: Use PostgreSQL database
fr: ``postgresql://<...>``: Utilise une base PostgreSQL

source: ``MOCKED`` is only designed for development and testing, do not use it in production.
fr: ``MOCKED`` est disponible uniquement à des fins de développement et de test, il ne faut pas l'utiliser en production.

source: Database connections
fr: Connexion à la Base de données

source: Environ: ``PARSEC_DB_MIN_CONNECTIONS``
fr: Environnement: ``PARSEC_DB_MIN_CONNECTIONS``

source: Default: ``5``
fr: Défaut: ``5``

source: Minimal number of connections to the database if using PostgreSQL.
fr: Nombre minimal de connexions à la base de données PostgreSQL.

source: Environ: ``PARSEC_DB_MAX_CONNECTIONS``
fr: Environnement: ``PARSEC_DB_MAX_CONNECTIONS``

source: Default: ``7``
fr: Défaut: ``7``

source: Maximum number of connections to the database if using PostgreSQL.
fr: Nombre maximum de connexions à la base de données PostgreSQL.

source: Blockstore URL
fr: URL de stockage des blocs

source: Environ: ``PARSEC_BLOCKSTORE``
fr: Environnement: ``PARSEC_BLOCKSTORE``

source: Blockstore configuration.
fr: Configuration du stockage des blocs.

source: ``POSTGRESQL``: Use the database specified in the ``--db`` param
fr: ``POSTGRESQL``: Utilise la base de données définie via le paramètre ``--db``

source: ``s3:[<endpoint_url>]:<region>:<bucket>:<key>:<secret>``: Use Amazon S3 storage
fr: ``s3:[<endpoint_url>]:<region>:<bucket>:<key>:<secret>``: Utilise le stockage de type Amazon S3"

source: ``swift:<auth_url>:<tenant>:<container>:<user>:<password>``: Use OpenStack SWIFT storage
fr: ``swift:<auth_url>:<tenant>:<container>:<user>:<password>``: Utilise le stockage de type OpenStack SWIFT

source: Note endpoint_url/auth_url are considered as https by default (e.g. `s3:foo.com:[...]` -> https://foo.com). Escaping must be used to provide a custom scheme (e.g. `s3:http\\://foo.com:[...]`).
fr: Noter que endpoint_url/auth_url sont considérées comme HTTPS par défaut (`s3:foo.com:[...]` deviant `https://foo.com`. Des caractères d'échappement doivent être ajoutés pour fournir un schéma personnalisé (`s3:http\\://foo.com:[...]`).

source: On top of that, multiple blockstore configurations can be provided to form a RAID0/1/5 cluster.
fr: En plus de ça, plusieurs configurations de blockstore peuvent être fournies pour former une grappe RAID0/1/5.

source: Each configuration must be provided with the form ``<raid_type>:<node>:<config>`` with ``<raid_type>`` RAID0/RAID1/RAID5, ``<node>`` a integer and ``<config>`` the MOCKED/POSTGRESQL/S3/SWIFT config.
fr: Chaque configuration doit être passée sous la forme``<raid_type>:<node>:<config>`` avec ``<raid_type>`` RAID0/RAID1/RAID5, ``<node>`` un nombre et ``<config>`` la configuration de type MOCKED/POSTGRESQL/S3/SWIFT.

source: For instance, to configure a RAID0 with 2 nodes::
fr: Par exemple, pour configurer un RAID0 avec deux nœuds::

source: ``MOCKED`` and ``POSTGRESQL`` are only designed for development and testing, do not use them in production.
fr: ``MOCKED`` et ``POSTGRESQL`` sont disponibles uniquement à des fins de développement et de test, il ne faut pas les utiliser en production.

source: Administration token
fr: Jeton d'administration

source: Environ: ``PARSEC_ADMINISTRATION_TOKEN``
fr: Environnement: ``PARSEC_ADMINISTRATION_TOKEN``

source: Secret token to access the administration api.
fr: Jeton secret pour accéder à l'api d'administration.

source: Environ: ``PARSEC_SSL_KEYFILE``
fr: Environnement: ``PARSEC_SSL_KEYFILE``

source: SSL key file. This setting enables serving Parsec over SSL.
fr: Fichier de clé SSF. Permet d'utiliser Parsec au-dessus de SSL.

source: Environ: ``PARSEC_SSL_CERTFILE``
fr: Environnement: ``PARSEC_SSL_CERTFILE``

source: SSL certificate file. This setting enables serving Parsec over SSL.
fr: Fichier de certificat SSL. Permet d'utiliser Parsec au-dessus de SSL.

source: Environ: ``PARSEC_FORWARD_PROTO_ENFORCE_HTTPS``
fr: Environnement: ``PARSEC_FORWARD_PROTO_ENFORCE_HTTPS``

source: Enforce HTTPS by redirecting incoming request that do not comply with the provided header. This is useful when running Parsec behind a forward proxy handing the SSL layer. You should *only* use this setting if you control your proxy or have some other guarantee that it sets/strips this header appropriately. Typical value for this setting should be `X-Forwarded-Proto:https`.
fr: Impose le HTTPS en redirigeant les requêtes entrantes qui ne correspondent pas à l'entête fourni. Peut être utile lorsque Parsec tourne derrière un forward-proxy qui gère la couche SSL. N'utilisez ce paramètre que si vous avez le contrôle de votre proxy ou que vous avez la garantie qu'il gère correctement cet entête.

source: Environ: ``PARSEC_LOG_LEVEL``
fr: Environnement: ``PARSEC_LOG_LEVEL``

source: Default: ``WARNING``
fr: Défaut: ``WARNING``

source: The granularity of Error log outputs.
fr: Granularité des logs d'erreurs.

source: Must be one of ``DEBUG``, ``INFO``, ``WARNING``, ``ERROR``, ``CRITICAL``.
fr: Doit être ``DEBUG``, ``INFO``, ``WARNING``, ``ERROR`` ou ``CRITICAL``.

source: Environ: ``PARSEC_LOG_FORMAT``
fr: Environnement: ``PARSEC_LOG_FORMAT``

source: Default: ``CONSOLE``
fr: Défaut: ``CONSOLE``

source: Log formatting to use. Must be one of ``CONSOLE``, ``JSON``.
fr: Format de log utilisé. Doit être ``CONSOLE`` ou ``JSON``.

source: Environ: ``PARSEC_LOG_FILE``
fr: Environnement: ``PARSEC_LOG_FILE``

source: Default: log to stderr
fr: Défaut: log dans stderr

source: The log file to write to.
fr: Le fichier de log dans lequel écrire.

source: Environ: ``PARSEC_BACKEND_ADDR``
fr: Environnement: ``PARSEC_BACKEND_ADDR``

source: URL to reach this server (typically used in invitation emails).
fr: URL pour communiquer avec ce serveur (utilisé pour les emails d'invitation.

source: Environ: ``PARSEC_EMAIL_HOST``
fr: Environnement: ``PARSEC_EMAIL_HOST``

source: The host to use for sending email.
fr: L'hôte à utiliser pour l'envoi d'email.

source: Environ: ``PARSEC_EMAIL_PORT``
fr: Environnement: ``PARSEC_EMAIL_PORT``

source: Default: ``25``
fr: Défaut: ``25``

source: Port to use for the SMTP server defined in EMAIL_HOST.
fr: Le port à utiliser pour le serveur SMTP défini dans EMAIL_HOST.

source: Environ: ``PARSEC_EMAIL_HOST_USER``
fr: Environnement: ``PARSEC_EMAIL_HOST_USER``

source: Username to use for the SMTP server defined in EMAIL_HOST.
fr: Le nom d'utilisateur à utiliser pour le serveur SMTP défini dans EMAIL_HOST.

source: Environ: ``PARSEC_EMAIL_HOST_PASSWORD``
fr: Environnement: ``PARSEC_EMAIL_HOST_PASSWORD``

source: Password to use for the SMTP server defined in EMAIL_HOST. This setting is used in conjunction with EMAIL_HOST_USER when authenticating to the SMTP server.
fr: Le mot de passe à utiliser pour le serveur SMTP défini dans EMAIL_HOST. Ce mot de passe est utilisé avec EMAIL_HOST_USER pour l'authentification auprès du serveur SMTP.

source: Environ: ``PARSEC_EMAIL_USE_SSL``
fr: Environnement: ``PARSEC_EMAIL_USE_SSL``

source: Whether to use a TLS (secure) connection when talking to the SMTP server. This is used for explicit TLS connections, generally on port 587.
fr: Utiliser ou non une connexion TLS sécurisée pour communiquer avec le serveur SMTP. Utilisé pour une connexion TLS explicite, généralement sur le port 587.

source: Environ: ``PARSEC_EMAIL_USE_TLS``
fr: Environnement: ``PARSEC_EMAIL_USE_TLS``

source: Whether to use an implicit TLS (secure) connection when talking to the SMTP server. In most email documentation this type of TLS connection is referred to as SSL. It is generally used on port 465. Note that ``--email-use-tls``/``--email-use-ssl`` are mutually exclusive, so only set one of those settings to True.
fr: Utiliser ou non une connexion TLS sécurisée pour communiquer avec le serveur SMTP. Dans la plupart des documentation, ce type de connexion TLS est nommé SSL. Elle utilise généralement le port 465.À noter que ``--email-use-tls``/``--email-use-ssl`` sont mutuellement exclusifs, un seul doit être mis à True.

source: Environ: ``PARSEC_EMAIL_LANGUAGE``
fr: Environnement: ``PARSEC_EMAIL_LANGUAGE``

source: Default: ``en``
fr: Défaut: ``en``

source: Language used in email (Allowed values: ``en`` or ``fr``).
fr: La langue à utiliser dans les emails (Valeurs possibles: ``en`` (Anglais) ou ``fr`` (Français)).

source: Environ: ``PARSEC_SPONTANEOUS_ORGANIZATION_BOOTSTRAP``
fr: Environnement: ``PARSEC_SPONTANEOUS_ORGANIZATION_BOOTSTRAP``

source: Allow organization bootstrap without prior creation.
fr: Autoriser le démarrage d'une organisation sans l'avoir créée au préalable.

source: Without this flag, an organization must be created by administration (see ``parsec core create_organization`` command) before bootstrap can occur.
fr: Sans cette option, une organisation doit d'abord être créée par un administrateur (voir ``parsec core create_organization`` command) avant que le démarrage puisse être effectué.

source: With this flag, the server allows anybody to bootstrap an organization by providing an empty bootstrap token given 1) the organization is not bootstrapped yet and 2) the organization hasn't been created by administration (which would act as a reservation and change the bootstrap token)
fr: Avec cette option, le serveur permet à n'importer qui de créer et démarrer une organisation en donnant un jeton de démarrage vide, à condition que 1) l'organisation n'a pas été déjà démarrée et 2) l'organisation n'a pas été créée par l'administration (ce qui réserverait l'organisation et changerait le jeton de démarrage).

source: Environ: ``PARSEC_ORGANIZATION_BOOTSTRAP_WEBHOOK``
fr: Environnement: ``PARSEC_ORGANIZATION_BOOTSTRAP_WEBHOOK``

source: URL to notify 3rd party service that a new organization has been bootstrapped.
fr: URL pour avertir les tierces parties qu'une nouvelle organisation a été démarrée.

source: Each time an organization is bootstrapped, an HTTP POST will be send to the URL with an ``application/json`` body with the following fields: ``organization_id``, ``device_id``, ``device_label`` (can be null), ``human_email`` (can be null), ``human_label`` (can be null).
fr: Chaque fois qu'une organisation est démarrée, un POST HTTP est envoyé à l'URL avec un corps ``application/json`` qui contient les champs suivants: ``organization_id``, ``device_id``, ``device_label`` (possiblement NULL), ``human_email`` (possiblement NULL), ``human_label`` (possiblement NULL).

source: Example:
fr: Exemple :

source: ``--sse-keepalive <float>``
fr: ``--ssl-keepalive <float>``

source: Environ: ``PARSEC_SSE_KEEPALIVE``
fr: Environnement: ``PARSEC_SSE_KEEPALIVE``

source: Default: ``30``
fr: Défaut: ``30``

source: Keep SSE connection open by sending keepalive messages to client (pass <= 0 to disable).
fr: Maintenir la connexion SSE ouverte en envoyant des messages keepalive au client (passer <= 0 pour désactiver).

source: Environ: ``PARSEC_SENTRY_DSN``
fr: Environnement: ``PARSEC_SENTRY_DSN``

source: `Sentry <https://sentry.io/>`_ URL for telemetry report.
fr: URL de `Sentry <https://sentry.io/>`_ utilisé pour la télémétrie.

source: Environ: ``PARSEC_SENTRY_ENVIRONMENT``
fr: Environnement: ``PARSEC_SENTRY_ENVIRONMENT``

source: Default: ``production``
fr: Défaut: ``production``

source: Customize environment name for Sentry's telemetry reports.
fr: Paramètre de nom d'environnement de Sentry pour la télémétrie.

source: Debug
fr: Débogage

source: Environ: ``PARSEC_DEBUG``
fr: Environnement: ``PARSEC_DEBUG``

source: Enable debug information.
fr: Active les informations de débogage.

source: Equivalent to ``--debug --db=MOCKED --blockstore=MOCKED --administration-token=s3cr3t --email-sender=no-reply@parsec.com --email-host=MOCKED --backend-addr=parsec://localhost:<port>(?no_ssl=False if ssl is not set)``.
fr: Équivalent à ``--debug --db=MOCKED --blockstore=MOCKED --administration-token=s3cr3t --email-sender=no-reply@parsec.com --email-host=MOCKED --backend-addr=parsec://localhost:<port>(?no_ssl=False si le SSL n'est pas activé)``.
