Repository: Scille/parsec-cloud
Catalog: docs/locale/*/LC_MESSAGES/introduction.po
Languages: fr

source: Parsec is a free software (AGPL v3) aiming at easily share your work and data in the cloud in a total privacy thanks to end-to-end cryptographic security.
fr: Parsec est un logiciel libre (AGPL v3) visant à permettre de partager votre travail et vos données dans le cloud en toute confidentialité par le biais d'un système de chiffrement de bout en bout.

source: Key features:
fr: Principales fonctionnalités

source: Works as a virtual drive on you computer. You can access and modify all the data stored in Parsec with your regular softwares just like you would on your local hard-drive.
fr: Parsec fonctionne comme un disque virtuel sur votre ordinateur. Vous pouvez accéder et modifier les données stockées dans Parsec avec vos logiciels habituels de la même façon que vous feriez avec des données présentes sur votre disque dur.

source: Never lose any data. Encrypted data are synchronized with the remote server that never destroys anything, hence you can browse data history and recover from any point in time.
fr: Ne perdez jamais la moindre donnée ! Les données chiffrées sont synchronisées avec le serveur distant qui ne supprime jamais rien. Vous pouvez donc consulter l'historique de vos données et revenir à n'importe où dans le passé.

source: Client-side cryptographic security. Data and metadata are only visible by you and the ones you choose to share with.
fr: Chiffrement effectué côté client. Les données et méta-données ne sont lisibles que par vous et ceux avec qui vous avez décidé de les partager.

source: Cryptographic signature. Each modification is signed by it author making trivial to identify modifications.
fr: Signature cryptographique. Chaque modification est signée par son auteur, rendant donc triviale son identification.

source: Simplified enrollment. New user enrollment is simple as sharing a link and a token code.
fr: Inscription des nouveaux utilisateurs facilitée. Il suffit de partager un lien d'invitation ainsi qu'un code pin au nouveau venu pour l'ajouter au système.

source: Simple to host. Parsec server only requires a PostgreSQL DB and Amazon S3 or OpenStack Swift object storage.
fr: Simple à auto-héberger. Le serveur Parsec ne requière qu'une base PostgreSQL ainsi qu'une solution de stockage objet de type OpenStack Swift ou Amazon S3

source: Overview
fr: Vue d'ensemble

source: Parsec is divided between a client (responsible for expose data to the user and provide an encryption layer) and a server (storing the encrypted data and notifying clients about other users activity such as data modification or new sharing).
fr: Parsec est divisé en un client (responsable d'exposer les données à l'utilisateur ainsi que de gérer la couche cryptographique) et le serveur (servant à stocker les données chiffrées ainsi qu'à notifier les client des actions des autres utilisateurs tel une modification d'un fichier ou un nouveau partage)

source: Parsec single server, multi organizations showcase
fr: Cas d'usage de Parsec avec un seul serveur contenant plusieurs organisations
