Repository: Scille/parsec-cloud
Catalog: docs/locale/*/LC_MESSAGES/roles.po
Languages: fr

source: Profiles and Roles
fr: Profils et Rôles

source: User management
fr: Gestion des utilisateurs

source: There are two profiles for user management:
fr: Il existe deux profils pour la gestion des utilisateurs :

source: The User profile enables
fr: Le profil Utilisateur permet

source: the creation of Workspaces;
fr: la création d’un Espace de Travail;

source: the data management (creation, modification, history, integrity information);
fr: la gestion de données (création, modification, historique, informations sur l’intégrité);

source: the data sharing inside a Workspace;
fr: le partage des données au sein d’un Espace de Travail;

source: the creation of its own Devices.
fr: la création de ses propres Terminaux.

source: The Administrator profile enables
fr: Le profil Administrateur permet

source: the same roles of the User profile;
fr: tous les droits du profil Utilisateur;

source: the creation of Users (either with Administrator profile or User profile);
fr: la création d’autres utilisateurs (avec profil Administrateur ou Utilisateur);

source: the deletion of Users regardless of their profile.
fr: la suppression d'un Utilisateur quelque soit son profil.

source: It is not possible to modify the user's profile: an Administrator will remain an Administrator; a User will remain a User. Therefore, the user must be deleted and then re-created in order to allocate him the new profile.
fr: Le profil est défini à la création de l'utilisateur et n'est pas modifiable par la suite: un Administrateur restera un Administrateur ; un Utilisateur restera un Utilisateur. Il faut donc supprimer l'utilisateur puis le recréer afin de lui attribuer le nouveau profil.

source: Device management
fr: Gestion des terminaux

source: Only the user, regardless the profile, can create devices for itself. Devices are clones. The number of devices created by a user is usually small.
fr: Seul l'utilisateur, quel que soit son profil, peut créer des terminaux pour lui-même. Les terminaux sont des clones. Le nombre de terminaux créés par un utilisateur est généralement faible.

source: When a user is deleted, all the associated devices are deleted. It is not possible to delete a single device.
fr: Lorsqu'un utilisateur est supprimé, tous les terminaux associés sont supprimés. Il n'est pas possible de supprimer un seul terminal.

source: Management of Workspaces and Documents
fr: Gestion des Espaces de Travail et des Documents

source: There are four roles having different rights in a workspace:
fr: Il existe quatre rôles ayant des droits différents au sein d’un Espace de Travail :

source: Reader: it has **read** access.
fr: Lecteur : ne dispose des accès qu’en **lecture**.

source: Contributor: it has **read** and **write** access.
fr: Contributeur : dispose des accès en **lecture** et en **écriture**.

source: Manager: it has **read** and **write** access and can also **grant roles** with the exception of the Owner role.
fr: Gérant : dispose d'un accès en **lecture** et en **écriture** et peut également **accorder des rôles** à l'exception du rôle de Propriétaire.

source: Owner: it has **read** and **write** access and can also **grant roles** including the Owner role. It can also **trigger a complete Workspace re-encryption** in case of a prior user deletion (for example following the compromise of a user's device). A Workspace can have multiple Owners. The Workspace creator has the Owner role by default.
fr: Propriétaire : dispose d'un accès en **lecture** et **écriture** et peut également **accorder des rôles**, y compris le rôle de Propriétaire. Il peut également **déclencher un ré-encryptage complet de l'Espace de Travail** en cas de suppression préalable d'un utilisateur (par exemple suite à la compromission du dispositif d'un utilisateur). Un Espace de Travail peut avoir plusieurs Propriétaires. Le créateur de l'espace de travail a le rôle de Propriétaire par défaut.
