Repository: Scille/parsec-cloud
Catalog: docs/locale/*/LC_MESSAGES/userguide/first_steps.po
Languages: fr

source: First steps with Parsec
fr: Premiers pas avec Parsec

source: Welcome to Parsec! Here's a brief overview of the user interface.
fr: Bienvenue à Parsec ! Voici un bref aperçu de l'interface utilisateur.

source: Parsec graphical user interface overview
fr: Aperçu de l'interface utilisateur de Parsec

source: \1. **Organization section**: select your organization and access your organization details (if allowed by your profile).
fr: \1. **Section organisation** : sélectionnez votre organisation et accédez aux détails de votre organisation (si votre profil le permet).

source: \2. **Recent workspaces and documents**: list of workspaces and documents you have accessed recently.
fr: **Espaces et documents récents** : une liste des espaces de travail et des documents auxquels vous avez accédés récemment.

source: \3. **Main menu**: access application settings and your user profile.
fr: \3. **Menu principal** : accès aux paramètres de l'application et à votre profil d'utilisateur.

source: \4. **Workspace section**: access a workspace and its documents.
fr: \4. **Section espace de travail** : accès à un espace de travail et à ses documents.

source: Security best practices
fr: Bonnes pratiques en matière de sécurité

source: To avoid losing access to your data you should always:
fr: Pour éviter de perdre l'accès à vos données, vous devez toujours :

source: :ref:`Add multiple devices <doc_userguide_manage_devices>` to access Parsec
fr: :ref:`Ajouter plusieurs appareils <doc_userguide_manage_devices>` pour accéder à Parsec

source: :ref:`Share your workspaces <doc_userguide_parsec_workspaces_share>` with other users
fr: :ref:`Partagez vos espaces de travail <doc_userguide_parsec_workspaces_share>` avec d'autres utilisateurs

source: Strong cryptographic security prevents data recovery. This means that if you lose access to your computer, or cannot log in for any reason, there is no way to recover your data.
fr: La sécurité cryptographique forte empêche la récupération des données. Cela signifie que si vous perdez l'accès à votre ordinateur ou si vous ne pouvez pas vous connecter pour une raison quelconque, il n'y a aucun moyen de récupérer vos données.
