Repository: Scille/parsec-cloud
Catalog: docs/locale/*/LC_MESSAGES/userguide/installation.po
Languages: fr

source: Install Parsec
fr: Installation de Parsec

source: Install Parsec app
fr: Installation de l'application Parsec

source: Parsec is available for Linux, Mac, and Windows operating systems.
fr: Parsec est disponible pour les systèmes d'exploitation Linux, Mac et Windows.

source: Download the latest stable version of the Windows installer:
fr: Téléchargez la dernière version stable de l'installeur Windows :

source: download parsec
fr: télécharger parsec

source: Start the ``.exe`` and follow the instructions to install Parsec.
fr: Lancez le ``.exe`` et suivez les instructions pour installer Parsec.

source: Parsec is available on the `Snap Store <https://snapcraft.io/parsec/>`_:
fr: Parsec est disponible sur le `Snap Store <https://snapcraft.io/parsec/>`_ :

source: You can install Parsec from the command line:
fr: Vous pouvez installer Parsec depuis la ligne de commande :

source: If you are familiar with Snap, you may notice that Parsec is provided in *classic* mode (i.e. without sandbox). This is required because Parsec needs `Fuse <https://en.wikipedia.org/wiki/Filesystem_in_Userspace>`_ to mount your data as a virtual directory, which is not allowed by the Snap sandbox.
fr: Si vous connaissez Snap, vous avez peut-être remarqué que le snap Parsec fonctionne en mode **classique** (c'est à dire sans isolation). Cela est nécessaire car Parsec utilise `Fuse <https://fr.wikipedia.org/wiki/Filesystem_in_Userspace>`_ pour exposer vos données comme un disque virtuel, ce qui n'est pas autorisé par l'isolation de Snap.

source: On Ubuntu 25.04 and later, a bug may prevent your workspaces from being exposed in the file system (see `bug report <https://bugs.launchpad.net/ubuntu/+source/apparmor/+bug/2139081>`_).
fr: Sur Ubuntu 25.04 ou ultérieur, un bug peut empêcher vos espaces de travail d'apparaître dans le système de fichier (voir `le rapport de bug <https://bugs.launchpad.net/ubuntu/+source/apparmor/+bug/2139081>`_).

source: As a workaround, you can run the following command while Parsec is not running:
fr: Comme contournement, vous pouvez lancer la commande suivante alors que Parsec ne tourne pas :

source: In order to install multiple versions of Parsec, you first need to enable `parallel instances <https://snapcraft.io/blog/parallel-installs-test-and-run-multiple-instances-of-snaps>`_:
fr: Pour installer plusieurs versions de Parsec, vous devez d'abord activer les `instances parallèles <https://snapcraft.io/blog/parallel-installs-test-and-run-multiple-instances-of-snaps>`_ :

source: Then, you can install v3.0 (provided you already have v2.17 installed), give it a specific name:
fr: Ensuite, vous pouvez installer la v3.0 (à condition d'avoir déjà installé la v2.17), en lui donnant un nom spécifique :

source: AppImage support is currently in alpha, you are likely to encounter crashes if your Linux distribution differs too much from Ubuntu 24.04.
fr: Le support d'AppImage est actuellement en alpha, vous êtes susceptible de rencontrer des plantages si votre distribution Linux diffère trop de Ubuntu 24.04.

source: Download the latest stable version of the **AppImage** file:
fr: Téléchargez la dernière version stable du fichier **AppImage** :

source: Make the ``.AppImage`` file executable
fr: Rendez le fichier ``.AppImage`` exécutable

source: Right-click/Properties/Allow executing file as program
fr: Faite un clic-droit/Propriétés/Autoriser l'exécution du fichier en tant que programme

source: Or use the `chmod` command:
fr: Ou utilisez la commande `chmod` :

source: Run it (double-click on the ``.AppImage`` file)
fr: Exécutez-le (double-cliquez sur le fichier ``.AppImage``)

source: Download the latest stable version of the **macOS installer**:
fr: Téléchargez la dernière version stable de l'installateur **macOS** :

source: Start the ``.dmg`` installer and follow the instructions to install **Parsec app**.
fr: Lancez le fichier ``.dmg`` et suivez les instructions d'installation.

source: Install macFUSE (see below)
fr: Installation de macFUSE (voir ci-dessous)

source: Parsec requires `macFUSE <https://osxfuse.github.io/>`_ in order to provide a smooth integration with macOS and let you access your documents via Finder (macOS file manager).
fr: Parsec nécessite `macFUSE <https://osxfuse.github.io/>`_ afin de fournir une intégration fluide avec macOS et de vous permettre d'accéder à vos documents via Finder (le gestionnaire de fichiers de macOS).

source: **Install macFUSE**
fr: **Installation de macFUSE**

source: This section describes how to install macFUSE.
fr: Cette section décrit comment installer macFUSE.

source: Get the latest version from the `macFUSE website <https://osxfuse.github.io/>`_.
fr: Téléchargez la dernière version sur le `site web de macFUSE <https://osxfuse.github.io/>`_.

source: macFUSE download screen
fr: écran de téléchargement de macFUSE

source: Open the macFUSE ``.dmg`` file and follow instructions to install.
fr: Ouvrez le fichier ``.dmg`` de macFUSE et suivez les instructions d'installation.

source: If you cannot open the ``.dmg`` file because it was not downloaded from the App Store, head to `System Settings > Privacy and Security` on your Mac and scroll down to the `Security` section. You can either check `App Store & Known Developers` in the `Allow applications from` dropdown menu to make this installation and further updates smoother, or click `Open Anyway` for a one-time authorization.
fr: Si vous ne parvenez pas à ouvrir le ``.dmg`` parce qu'il n'a pas été téléchargé depuis l'App Store, rendez-vous dans `Réglages Système > Confidentialité et Sécurité` sur votre Mac puis faites défiler vers le bas jusqu'à la section `Sécurité`. Vous pouvez soit cocher l'option `App Store et développeurs identifiés` dans le menu déroulant `Autoriser les applications depuis` pour une installation et des mises à jour plus fluides, soit cliquer sur `Ouvrir quand même` pour l'autoriser ponctuellement.

source: At the end of the installation, you will be prompted to approve this extension in `System Settings > Privacy and Security`. Scroll down to the `Security` section, and click `Allow` as illustrated below.
fr: À l'issue de cette installation, il vous sera demandé d'autoriser cette extension dans `Réglages Système > Confidentialité et Sécurité`. Faites défiler vers le bas jusqu'à la section `Sécurité`, puis cliquez sur `Autoriser` comme illustré ci-dessous.

source: macFUSE approve screen
fr: écran d'autorisation de macFUSE

source: You will then be prompted to restart your Mac to complete the installation. Be mindful that the **Parsec app** will not function properly until this restart is done.
fr: Il vous sera ensuite demandé de redémarrer votre Mac pour finaliser cette installation. Il est important de préciser que l'**application Parsec** ne pourra pas fonctionner correctement tant que ce redémarrage n'a pas été effectué.

source: Update Parsec app
fr: Mise à jour de l'application Parsec

source: Automatic updates are supported and enabled. When a new version is released, Parsec app updates automatically on startup.
fr: Les mises à jour automatiques sont supportées et activées. Lorsqu'une nouvelle version est publiée, l'application Parsec se met à jour automatiquement au démarrage.

source: If Parsec app is running, A message is displayed. Simply click on the message to update the application.
fr: Si l'application Parsec est en cours d'exécution, un message s'affiche. Il suffit de cliquer sur le message pour mettre à jour l'application.

source: Install an older version of Parsec
fr: Installer une ancienne version de Parsec

source: For security reasons, you should **always install the latest stable version of Parsec** as it contains the latest security fixes.
fr: Pour des raisons de sécurité, vous devriez **toujours installer la dernière version stable de Parsec** car elle contient les derniers correctifs de sécurité.

source: If you need to access older versions, they are available on `GitHub`_.
fr: Si vous avez besoin d'accéder à des versions plus anciennes, elle sont disponibles sur `GitHub`_.
