Repository: Scille/parsec-cloud
Catalog: docs/locale/*/LC_MESSAGES/userguide/join_organization.po
Languages: fr

source: Join an organization
fr: Rejoindre une organisation

source: You have been invited to join an organization on Parsec! Before you get started, please make sure you have :ref:`installed the Parsec app <doc_userguide_install_parsec>`.
fr: Vous avez été invité à rejoindre une organisation sur Parsec ! Avant de commencer, assurez-vous d'avoir :ref:`installé l'application Parsec <doc_userguide_install_parsec>`.

source: Start the invitation process
fr: Lancer le processus d'invitation

source: If you received an **invitation link** either by email or by any other means, :ref:`first verify it <userguide-verify-parsec-link>`.
fr: Si vous avez reçu un **lien d'invitation** par e-mail ou par tout autre moyen, :ref:`premièrement vérifie le <userguide-verify-parsec-link>`.

source: If you do not trust the link, do not proceed with the invitation.
fr: Si vous n'avez pas confiance en le lien, ne poursuivez pas avec l'invitation.

source: After making sure that the link is safe, simply click on the link. Parsec will start and guide you through the invitation process.
fr: Après vous être assuré que le lien est sûr, cliquez simplement dessus. Parsec démarrera et vous guidera tout au long du processus d'invitation.

source: You can also start Parsec manually and paste the **invitation link** on the login screen then click ``Join``.
fr: Vous pouvez demarrer Parsec manuellement et copier et coller le **liens d'invitation** dans l'ecran de connexion and cliquer sur ``rejoindre``.

source: Token exchange
fr: Échange de token

source: In order to create a secure channel between the **guest** (you) and the **host**, you will need to carry out a **code exchange** via an **authentic channel** (such as a regular phone call).
fr: Afin de créer un canal sécurisé entre l'**invité** (vous) et l'**hôte**, vous devrez procéder à un **échange de codes** via un **canal authentique** (tel qu'un appel téléphonique ordinaire).

source: Authentic channels are not confidential, but they guarantee that the information is not tampered: what your contact says is what you hear. You should avoid using SMS.
fr: Les canaux authentiques ne sont pas confidentiels, mais ils garantissent que l'information n'est pas altérée : ce que votre contact dit est ce que vous entendez. Les SMS sont à éviter.

source: When you are ready, click ``I understand!`` and wait for the host to start the process on its side.
fr: Lorsque vous êtes prêt, cliquez sur ``J'ai compris !`` et attendez que l'hôte lance le processus de son côté.

source: Select the code provided by your host from the list.
fr: Sélectionnez dans la liste le code fourni par votre hôte.

source: List of codes to select the host code
fr: Liste des codes pour sélectionner le code de l'hôte

source: Then, share your code to the host and wait until it is selected.
fr: Ensuite, communiquez votre code à l'hôte et attendez qu'il soit sélectionné.

source: Your guest coded to be provided to the host
fr: Code de l'invité à fournir à l'hôte

source: If one of the codes to share is not present in the other's list, it means there is a very high probability you are victim of a `Man-in-the-middle attack <https://en.wikipedia.org/wiki/Man-in-the-middle_attack>`_.
fr: Si l'un des codes à partager n'est pas présent dans la liste de l'autre, cela signifie qu'il y a une très forte probabilité que vous soyez victime d'une attaque de type `Man-in-the-middle <https://fr.wikipedia.org/wiki/Attaque_de_l%27homme_du_milieu>`_.

source: Set up your account
fr: Configurez votre compte

source: Finally, enter your **contact details** and choose the preferred **authentication method** (this can be changed later from your profile).
fr: Enfin, entrez vos **coordonnées** et choisissez la **méthode d'authentification** préférée (vous pourrez le modifier ultérieurement à partir de votre profil).

source: You are ready for your :ref:`first steps with Parsec! <doc_userguide_first_steps>`
fr: Vous êtes prêt pour vos :ref:`premiers pas avec Parsec ! <doc_userguide_first_steps>`
