Repository: Scille/parsec-cloud
Catalog: docs/locale/*/LC_MESSAGES/userguide/manage_organization.po
Languages: fr

source: Manage your organization
fr: Gérer votre organisation

source: Now that our organization is ready, we can start inviting new users.
fr: Maintenant que notre organisation est prête, nous pouvons commencer à inviter de nouveaux utilisateurs.

source: In Parsec, inviting a new user to join your organization is a critical operation that aims at building trust towards the user and the device that will be used to connect to Parsec.
fr: Dans Parsec, inviter un nouvel utilisateur à rejoindre votre organisation est une opération critique qui vise à établir la confiance envers l'utilisateur et l'appareil qui sera utilisé pour se connecter à Parsec.

source: The process requires both the guest (the invited user) and the host (you) to be connected to the Parsec server at the same time.
fr: Pour ce faire, l'utilisateur invité et l'utilisateur hôte (vous) doivent être connectés au serveur Parsec en même temps.

source: Invite a user
fr: Inviter un utilisateur

source: Go to ``Manage my organization``
fr: Aller à ``Gérer de mon organisation``

source: Click ``Invite a user`` and enter its email address to send an **invitation link**
fr: Cliquez sur ``Inviter un utilisateur`` et entrez son adresse e-mail pour envoyer un **lien d'invitation**

source: A yellow button will appear at the top, informing you that you have an invitation waiting to be validated.
fr: Un bouton jaune apparaît en haut, vous informant que vous avez une invitation qui attend d'être validée.

source: Pending invitations
fr: Invitations en attente

source: Ask the guest to open the invitation link and follow the steps to :ref:`Join an organization <doc_userguide_join_organization>`.
fr: Demandez à l'invité d'ouvrir le lien d'invitation et de suivre les étapes pour :ref:`Rejoindre une organisation <doc_userguide_join_organization>`.

source: Click on ``Greet`` and wait for the guest to proceed to the :ref:`Token exchange <doc_userguide_join_organization_token_exchange>`.
fr: Cliquez sur ``Accueillir`` et attendez que l'invité passe à :ref:`Échange de token <doc_userguide_join_organization_token_exchange>`.

source: Confirm the user details and set its :ref:`user profile <doc_userguide_manage_organization_profiles>`.
fr: Confirmez les détails de l'utilisateur et définissez son :ref:`profil d'utilisateur <doc_guide_utilisateur_gérer_les_profils_d'organisation>`.

source: Revoke a user
fr: Révoquer un utilisateur

source: Revoking a user will remove its access rights to the organization. This is specially required when:
fr: La révocation d'un utilisateur supprime ses droits d'accès à l'organisation. Cette opération est particulièrement nécessaire dans les cas suivants:

source: the user device has been compromised or lost
fr: l'appareil de l'utilisateur a été compromis ou perdu

source: the user is no longer part of the organization
fr: l'utilisateur ne fait plus partie de l'organisation

source: Select ``Revoke this user``.
fr: Sélectionnez ``Révoquer cet utilisateur``.

source: Click ``Revoke`` to confirm (**this action cannot be undone**)
fr: Cliquez sur ``Révoquer`` pour confirmer (**cette action ne peut pas être annulée**)

source: Revocation is irreversible. If the revoked user needs to re-join the organization, it will need to go through the standard procedure to :ref:`join an organization <doc_userguide_join_organization>`
fr: La révocation est irréversible. Si l'utilisateur révoqué a besoin de réintégrer l'organisation, il devra suivre la procédure standard pour :ref:`rejoindre une organisation <doc_userguide_join_organization>`

source: It is not possible to revoke a single user device. If one of the user's devices has been compromised, the user and all its devices need to be revoked. This is intended because the compromised device has the knowledge of some cryptographic secrets shared among all the user's devices.
fr: Il n'est pas possible de révoquer un seul appareil d'utilisateur. Si l'un des dispositifs de l'utilisateur a été compromis, l'utilisateur et tous ses dispositifs doivent être révoqués. En effet, le dispositif compromis a connaissance de certains secrets cryptographiques partagés entre tous les dispositifs de l'utilisateur.

source: User profiles
fr: Profils utilisateur

source: The **user profiles** defines what the user is allowed to do within the organization.
fr: Les **profils utilisateur** définissent ce que l'utilisateur est autorisé à faire au sein de l'organisation.

source: External profile
fr: Profil Externe

source: This profile allows a user to:
fr: Ce profil permet à l'utilisateur de:

source: **Collaborate in workspaces**
fr: Collaborer dans les espaces de travail

source: Users with the External profile are not allowed to see the name and email of other users within the organization.
fr: Les utilisateurs ayant un profil externe ne sont pas autorisés à voir le nom et l'adresse électronique d'autres utilisateurs au sein de l'organisation.

source: Member profile
fr: Profil Membre

source: Collaborate in workspaces.
fr: Collaborer dans les espaces de travail.

source: **Create and share workspaces.**
fr: **Créer et partager des espaces de travail.**

source: **See the name and email of other users within the organization.**
fr: **Voir le nom et l'adresse électronique d'autres utilisateurs au sein de l'organisation.**

source: Administrator profile
fr: Profil Administrateur

source: Create and share workspaces.
fr: Créer et partager des espaces de travail.

source: See the name and email of other users within the organization.
fr: Voir le nom et l'adresse électronique d'autres utilisateurs au sein de l'organisation.

source: **Invite new users to join the organization, and set their profile.**
fr: **Inviter de nouveaux utilisateurs à rejoindre l'organisation et définir leur profil.**

source: **Remove users from the organization, regardless of their profile.**
fr: **Supprimer les utilisateurs de l'organisation, quel que soit leur profil.**

source: Change the profile
fr: Modifier le profil

source: If you need to change the profile of a user, go to ``Manage my organization`` in the upper-left corner. Either select the user or right-click on them and select ``Change profile``.
fr: Pour changer le profil d'un utilisateur, rendez vous dans ``Gérer mon organisation`` dans le coin supérieur gauche. Vous pouvez soit sélectionner l'utilisateur, ou faire un clic droit dessus et sélectionner ``Modifier le profil``.

source: change profile screenshot
fr: capture d'écran du changement de profil

source: Select the user's new profile and click on ``Change``.
fr: Choisissez le nouveau profil de l'utilisateur et cliquez sur ``Modifier``.

source: change profile dialog screenshot
fr: capture d'écran de la dialogue de changement de profil

source: You can change the profiles of multiple users at once by selecting them and clicking on ``Change profiles``.
fr: Vous pouvez changer les profils de plusieurs utilisateurs simultanément en les sélectionnant et en cliquant sur ``Modifier les profils``.

source: change multiple profiles screenshot
fr: capture d'écran du changement de plusieurs profils

source: You cannot change the profile from and to `External`. If there are users with `External` profile among the selected users, the dialog will warn you that their profile will not be affected.
fr: Il est impossible de changer un profil depuis et vers `Externe`. Si des utilisateurs avec le profil `Externe` figurent parmi les utilisateurs sélectionnés, la fenêtre vous avertira que leur profils ne seront pas changés.

source: change profile external warning screenshot
fr: capture d'écran de l'avertissement
