Repository: Scille/parsec-cloud
Catalog: docs/locale/*/LC_MESSAGES/userguide/manage_devices.po
Languages: fr

source: Manage your devices
fr: Gérer vos appareils

source: When you :ref:`join an organization <doc_userguide_join_organization>`, your computer is automatically added as a new **device** so you can securely access Parsec.
fr: Lorsque vous :ref:`rejoignez une organisation <doc_userguide_join_organization>`, votre ordinateur est automatiquement ajouté en tant que nouveau **appareil** afin que vous puissiez accéder à Parsec en toute sécurité.

source: For enhanced security, the devices you use to access Parsec are uniquely authenticated. It is highly recommended to add another device in case you lose access to your computer or cannot log in for any reason.
fr: Pour une sécurité accrue, les appareils que vous utilisez pour accéder à Parsec sont authentifiés de manière unique. Il est fortement recommandé d'ajouter un autre appareil au cas où vous perdriez l'accès à votre ordinateur ou ne pourriez pas vous connecter pour une raison quelconque.

source: Device keys are safely stored on your computer and are not sent to the Parsec server.
fr: Les clés de l'appareil sont stockées en toute sécurité sur votre ordinateur et ne sont pas envoyées au serveur de Parsec.

source: Without having added another device, your account cannot be recovered in the event you lose access to your computer. You will need to be re-invited to :ref:`join the organization <doc_userguide_join_organization>`.
fr: Si vous n'avez pas ajouté d'autre appareil, votre compte ne pourra pas être récupéré si vous perdez l'accès à votre ordinateur. Vous devrez être réinvité à :ref:`rejoindre l'organisation <doc_userguide_join_organization>`.

source: We strongly encourage you to create a :ref:`recovery file <doc_userguide_recovery_files>`.
fr: Nous vous recommandons de créer un :ref:`fichier de récupération <doc_userguide_recovery_files>`.

source: Add a new device
fr: Ajouter un nouvel appareil

source: You can add a new device from your profile page.
fr: Vous pouvez ajouter un nouvel appareil à partir de votre page de profil.

source: Click on your name on the main menu (top-right) and select ``My devices``.
fr: Cliquez sur votre nom dans le menu principal (en haut à droite) et sélectionnez ``Mes appareils``.

source: In ``My devices`` tab, click ``+ Add a new device``.
fr: Dans ``Mes appareils``, cliquez sur ``+ Ajouter un nouvel appareil``.

source: Device invitation link
fr: Lien d'invitation à l'appareil

source: Send the link to your new device, either by email or by any other means. Always :ref:`verify the link <userguide-verify-parsec-link>`.
fr: Envoyez le lien à votre nouvel appareil, soit par e-mail ou par tout autre moyens de communication. Toujours :ref:`vérifiez le lien <userguide-verify-parsec-link>`.

source: If you do not trust the link, do not proceed.
fr: Si vous n'avez pas confiance en le lien, ne continuez pas.

source: Once the verification done, on the new device, you can simply click on the link to start Parsec. Otherwise, you can copy the link, start Parsec and select ``Join`` in the welcome page (the application should have pre-filled the link with the clipboard content, but you can manually paste it). Then you follow the instructions to perform the code exchange between your devices.
fr: Une fois la vérification effectuée, sur le nouvel appareil, vous pouvez simplement cliquer sur le lien pour lancer Parsec. Sinon, vous pouvez copier le lien, lancer Parsec et sélectionner ``Rejoindre`` sur la page d'accueil (l'application devrait avoir prérempli le lien avec le contenu du presse-papiers, mais vous pouvez le coller manuellement). Ensuite, suivez les instructions pour effectuer l'échange de code entre vos appareils.

source: Always keep an eye on both devices during the process and not let anyone interfere. This includes notably the step of copying the link to the new device.
fr: Gardez toujours un œil sur les deux appareils pendant le processus et ne laissez personne interférer. Cela inclut notamment l'étape de copie du lien vers le nouvel appareil.

source: Adding a device
fr: Ajout d'un appareil

source: Your new device is ready to access Parsec!
fr: Votre nouvel appareil est prêt à accéder à Parsec !

source: If one of the codes to share is not present in the other's list, it means there is a very high probability you are victim of a `Man-in-the-middle attack <https://en.wikipedia.org/wiki/Man-in-the-middle_attack>`_.
fr: Si l'un des codes à partager n'est pas présent dans la liste de l'autre, cela signifie qu'il y a une très forte probabilité que vous soyez victime d'une attaque de type `Man-in-the-middle <https://fr.wikipedia.org/wiki/Attaque_de_l%27homme_du_milieu>`_.

source: Recovery files
fr: Fichiers de récupération

source: A recovery file allows you to get back access to your data in case your forgot your password or lose your computer.
fr: Un fichier de récupération vous permet de récupérer l'accès à vos données si vous oubliez votre mot de passe ou perdez votre ordinateur.

source: You will need:
fr: Vous aurez besoin :

source: the Recovery File, ending with `.psrk`
fr: un fichier de récupération qui se termine par `.psrk`

source: the Secret Key, a passphrase composed of letters and numbers separated by dashes.
fr: une clé secrète, une combinaison de lettres et de chiffres séparés par des tirets

source: The Secret Key is used to unlock the Recovery File and get access to your data.
fr: La clé secrète est utilisée pour déverrouiller le fichier et accéder à vos données.

source: A recovery file is linked to a specific organization. If you have multiple organizations, you need to create multiple recovery files.
fr: Un fichier de récupération est lié à une organisation. Si vous possédez plusieurs organisations, vous devrez créer plusieurs fichiers de récupération.

source: If someone gets access to both the recovery file and the secret key, they can get full access to your data as if they were you. We **strongly** recommend storing them separately in a safe place. They are as precious and secret as your password.
fr: Si une personne récupère l'accès au fichier et à la clé secrète simultanément, elle pourra obtenir l'accès total à vos données. Nous vous recommandons **fortement** de les stocker séparément dans un endroit sûr. Ils sont aussi précieux and secrets que votre mot de passe.

source: Create a recovery files
fr: Créer un fichier de récupération

source: When you access your profile, in the ``Recovery file`` page, click on ``Create a recovery file``.
fr: Quand vous accédez à votre profil, sur la page ``Fichier de récupération``, cliquez sur ``Créer un fichier de récupération``.

source: Access your profile
fr: Accédez à votre profil

source: Create a recovery file
fr: Créer un fichier de récupération

source: You'll be able to download both the Recovery File and the Secret Key. Make sure to get them both.
fr: Téléchargez le fichier et la clé secrète. Les deux sont essentiels.

source: As mentioned before, these two files combined will allow someone to access your data. Store them separately and don't let someone access them.
fr: Comme mentionné précédemment, ces deux fichiers combinés permettent à quelqu'un d'accéder à vos données. Stockez les séparément et ne laissez personne y avoir accès.

source: Download the recovery file and passphrase
fr: Téléchargez le fichier de récupération et la clé secrète

source: Use a recovery file to get back access
fr: Utiliser un fichier de récupération pour rétablir l'accès

source: If you forget your password and you have both the Recovery File and the Secret Key, you can use them and gain access back.
fr: Si vous oubliez votre mot de passe et que vous avez en votre possession le fichier de récupération et la clé secrète, vous pouvez les importer pour récupérer l'accès à vos données.

source: When trying to log in, click on ``Forgot your password?``.
fr: Au moment de la connexion, cliquez sur ``Mot de passe oublié ?``

source: Click on password forgotten
fr: Cliquez sur mot de passe oublié

source: You will be able to import the Recovery File and type in the Secret Key.
fr: Vous pouvez importer le fichier de récupération et entrer la clé secrète.

source: Once imported, Parsec will create a new device and you will be able to log into your organization by clicking ``Next``.
fr: Une fois importé, un nouvel appareil sera créé automatiquement et vous pourrez vous connecter à votre organisation en cliquant sur ``Suivant``.
