Repository: Scille/parsec-cloud
Catalog: docs/locale/*/LC_MESSAGES/userguide/new_organization.po
Languages: fr

source: Create an organization
fr: Créer une organisation

source: When you start Parsec for the first time, the welcome screen will propose to **create** or **join** an organization.
fr: Lorsque vous démarrez Parsec pour la première fois, l'écran d'accueil vous propose de **créer** ou **rejoindre** une organisation.

source: Welcome to Parsec
fr: Bienvenue à Parsec

source: Create an organization on Parsec
fr: Créer une organisation dans Parsec

source: This is the preferred option. Your organization will be securely created on our servers and associated to your customer account.
fr: C'est l'option recommandée. Votre organisation sera créée en toute sécurité sur nos serveurs et associée à votre compte client.

source: Please `visit our website to choose the offer <https://parsec.cloud/tarification/>`_ that best suits your needs and follow the steps to create your account.
fr: Visitez `notre site web pour choisir l'offre <https://parsec.cloud/tarification/>`_ qui correspond le mieux à vos besoins et suivez les étapes pour créer votre compte.

source: If you already have a customer account on Parsec, follow the steps below to create your organization:
fr: Si vous avez déjà un compte client sur Parsec, suivez les étapes ci-dessous pour créer votre organisation :

source: Start by clicking ``Create an organization`` on the welcome screen.
fr: Commencez par cliquer sur ``Créer une organisation`` dans l'écran d'accueil.

source: Select ``Create my organization on Parsec``.
fr: Sélectionnez ``Créer mon organisation sur Parsec``.

source: Log in with your customer account.
fr: Connectez-vous avec votre compte client.

source: Enter the organization name (this name cannot be changed later).
fr: Saisissez le nom de l'organisation (ce nom ne pourra pas être modifié ultérieurement).

source: Choose the preferred authentication method (this can be changed later from your profile).
fr: Choisissez la méthode d'authentification préférée (vous pouvez la modifier ultérieurement à partir de votre profil).

source: Check the information entered and confirm.
fr: Vérifiez les informations saisies et confirmez.

source: 🚀 Congratulations, you've just created your organization on Parsec!
fr: 🚀 Félicitations, vous venez de créer votre organisation sur Parsec !

source: Create an organization on Trial
fr: Créer une organisation sur le service d'Essai

source: Our **Trial service** allows you to **test Parsec for a limited time**. Your organization will be securely created on our servers. No customer account is required.
fr: Notre **service d'Essai** vous permet **d'essayer Parsec pour une durée limitée**. Votre organisation sera créée en toute sécurité sur nos serveurs. Aucun compte client n'est nécessaire.

source: Your organization and associated data will be deleted at the end of the trial period.
fr: Votre organisation et les données associées seront supprimées à la fin de la période d'essai.

source: Select ``Try Parsec for 15 days``.
fr: Sélectionnez ``Essayez Parsec pendant 15 jours``.

source: Enter your name and email address.
fr: Saisissez votre nom et votre adresse électronique.

source: Create an organization on my own Parsec server
fr: Créer une organisation sur mon propre serveur Parsec

source: Follow the steps below to create an organization on your own Parsec server:
fr: Suivez les étapes ci-dessous pour créer une organisation sur votre propre serveur Parsec :

source: Select ``Use a different Parsec server``.
fr: Sélectionnez ``Utiliser un autre serveur Parsec``.

source: Specify the organization name and the address of your own Parsec server.
fr: Indiquez le nom de l'organisation et l'adresse de votre propre serveur Parsec.

source: You can read more about hosting Parsec server in the :ref:`Hosting Guide <doc_adminguide_hosting>`.
fr: Vous pouvez en savoir plus sur l'hébergement du serveur Parsec dans le :ref:`Hosting Guide <doc_adminguide_hosting>`.
