Repository: Scille/parsec-cloud
Catalog: docs/locale/*/LC_MESSAGES/userguide/new_device.po
Languages: fr

source: Create new devices
fr: Créer de nouveaux terminaux

source: So far, we've only registered users on a single computer. However what would happened if this computer get lost or stolen ?
fr: Pour le moment, chaque utilisateur n'a été enregistré que sur un seul ordinateur. Que se passerait-il si cet ordinateur était volé ou perdu ?

source: For this reason it's a good idea for a user to register himself on multiple computers.
fr: C'est pour cette raison qu'il est une bonne pratique de s'enregistrer sur plusieurs ordinateurs.

source: To put it another way, a physical person is represented in Parsec by a user and each computer this person has is represented in Parsec by a device.
fr: Une autre façon de voir cela est de considérer qu'une personne physique est représentée dans Parsec par un utilisateur et que chaque ordinateur que la personne possède est représenté dans Parsec par un terminal.

source: Just like for the user, the device creation requires to have the inviting and the invitee devices both connected to the server at the same time.
fr: Comme pour créer un nouvel utilisateur, la création d'un nouveau terminal nécessite d'avoir le créateur de l'invitation et l'invité connectés au serveur simultanément.

source: Send invite
fr: Envoi de l'invitation

source: Inviting a new device is done from the Parsec client:
fr: Inviter un nouveau terminal se fait via le client Parsec:

source: Device invitation process
fr: Processus d'invitation d'un appareil

source: Once started the invitation is pending (note you can cancel it though) and the user must check his emails for an invitation link that has been sent to him.
fr: Une fois commencée, l'invitation apparait comme en attente (notez qu'il est toutefois possible de l'annuler) et l'utilisateur doit recevoir un lien d'invitation par email.

source: For cryptographic reasons, a user can only create new devices for himself.
fr: Pour des raisons liées aux procédés cryptographiques, un utilisateur ne peut créer de nouveaux terminaux que pour lui-même.

source: Receive invite
fr: Réception de l'invitation

source: The user should receive a link by email enabling him to register his device. Clicking on the invitation URL on the new computer should open up the Parsec client (it must have been installed previously). The token exchange will now start.
fr: L'utilisateur reçoit alors par email un lien d'activation lui permettant d'enregistrer son appareil. Cliquer sur ce lien d'activation sur le nouvel appareil devrait ouvrir le client Parsec (qui doit avoir été installé préalablement). L'échange de jeton va ensuite commencer.

source: If clicking on the URL doesn't work, you can also use the ``Enter a URL manually`` dialog inside Parsec.
fr: Si cliquer sur le lien ne fait rien, vous pouvez aussi utiliser le bouton ``Entrer un lien manuellement`` dans Parsec.

source: Given the password is only used locally, it doesn't have to be the same across devices.
fr: Le mot de passe n'étant utilisé que localement, il n'a pas besoin d'être le même pour les deux terminaux.

source: Token exchange
fr: Échange de jetons

source: The token exchange is a verification process that aims at ensuring that the two devices are not victim of a `Man-in-the-middle attack <https://en.wikipedia.org/wiki/Man-in-the-middle_attack>`_. You can read more about that process at the :ref:`Cryptography <doc_cryptography>` section.
fr: L'échange de jeton est un processus de vérification qui a pour but de s'assurer que les deux appareils ne sont pas victimes d'une `Attaque de l'homme du milieu <https://fr.wikipedia.org/wiki/Attaque_de_l%27homme_du_milieu>`_. Il est possible d'en apprendre plus à la section :ref:`Cryptographie <doc_cryptography>`.

source: The user will have to proceed to a token exchange between the two devices. For that, the devices will both display a token, or a list of tokens : on the device with the list, the user must click on the token displayed by the Parsec client of the other device. If the token one of them is given is not present in the list, it means there is a very high probability that the user is victim of a `Man-in-the-middle attack <https://en.wikipedia.org/wiki/Man-in-the-middle_attack>`_.
fr: L'utilisateur doit procéder à un échange de jetons entre ses deux appareils. Pour cela, les appareils afficheront chacun à leur tour un jeton, ou une liste de jetons : sur l'appareil sur lequel une liste est présentée, l'utilisateur doit cliquer sur le jeton affiché par le client Parsec de l'autre appareil. Si le jeton affiché par l'un des deux appareils ne se trouve pas dans la liste affichée par à l'autre, cela signifie qu'il y a une très forte probabilité que l'un des deux appareils soit victime d'une `Attaque de l'homme du milieu <https://fr.wikipedia.org/wiki/Attaque_de_l%27homme_du_milieu>`_.

source: Display of a token that has to be transmitted during a token exchange
fr: Affichage d'un jeton qui doit être transmis pendant l'échange des jetons

source: List of tokens displayed during a token exchange
fr: La liste des jetons affichés pendant l'échange des jetons

source: The user’s new Parsec client has been configured and is ready to log in.
fr: Le nouveau client Parsec de l'utilisateur a été configuré et est maintenant prêt à s'authentifier.
