Repository: Scille/parsec-cloud
Catalog: docs/locale/*/LC_MESSAGES/userguide/parsec_workspaces.po
Languages: fr

source: Parsec workspaces
fr: Espaces de travail Parsec

source: In Parsec, your data is securely stored within **workspaces**.
fr: Dans Parsec, vos données sont stockées en toute sécurité dans des **espaces de travail**.

source: Parsec workspace
fr: Espace de travail Parsec

source: You can import your data into a Parsec workspace and manage your files and directories as you will do with a regular file explorer.
fr: Vous pouvez importer vos données dans un espace de travail Parsec et gérer vos fichiers et répertoires comme vous le feriez avec un explorateur de fichiers classique.

source: Parsec file explorer
fr: Explorateur de fichiers Parsec

source: Workspaces are mounted by default in your system and will also appear in the file explorer as regular folders. This is convenient to copy files from and to Parsec.
fr: Les espaces de travail sont montés par défaut dans votre système et apparaissent dans l'explorateur de fichiers comme des dossiers normaux. Ceci est pratique pour copier des fichiers depuis et vers Parsec.

source: Each workspace has its own :ref:`role-based policy <doc_userguide_parsec_workspaces_roles>` for read and write access. This allows a fine-grained access control as each user can have different roles in different workspaces.
fr: Chaque espace de travail a sa propre :ref:`politique basée sur les rôles <doc_userguide_parsec_workspaces_roles>` pour l'accès en lecture et en écriture. Cela permet un contrôle d'accès très fin car chaque utilisateur peut avoir différents rôles dans différents espaces de travail.

source: When you are offline, you can still access documents provided they were synchronized by Parsec while connected. Synchronization will occur automatically as soon as the connection with the server is established.
fr: Lorsque vous êtes hors ligne, vous pouvez toujours accéder aux documents à condition qu'ils aient été synchronisés par Parsec lors de la connexion. La synchronisation se fait automatiquement dès que la connexion avec le serveur est établie.

source: Create a workspace
fr: Créer un espace de travail

source: You can create a workspace by clicking ``New workspace`` and entering a name for the workspace.
fr: Vous pouvez créer un espace de travail en cliquant sur ``Nouvel espace de travail`` et en saisissant un nom pour l'espace de travail.

source: Creating a workspace
fr: Créer un espace de travail

source: When you create a workspace, you automatically get the :ref:`Owner role <doc_userguide_parsec_workspaces_roles>` within the workspace.
fr: Lorsque vous créez un espace de travail, vous obtenez automatiquement le rôle :ref:`Owner <doc_userguide_parsec_workspaces_roles>` au sein de l'espace de travail.

source: Share a workspace
fr: Partager un espace de travail

source: If you have the **Owner** or **Manager** role, the ``Sharing and roles`` option will be available from the workspace menu.
fr: Si vous avez le rôle **Propriétaire** ou **Gérant**, l'option ``Partage et rôles`` sera disponible dans le menu de l'espace de travail.

source: Find the user you want to share the workspace with and select its :ref:`workspace roles <doc_userguide_parsec_workspaces_roles>`.
fr: Trouvez l'utilisateur avec lequel vous voulez partager l'espace de travail et sélectionnez son :ref:`rôles d'espace de travail <doc_userguide_parsec_workspaces_roles>`.

source: Sharing a workspace
fr: Partager un espace de travail

source: Depending on the user profile within the organization, some roles may not be available for the selected user.
fr: Selon le profil de l'utilisateur au sein de l'organisation, certains rôles peuvent ne pas être disponibles pour l'utilisateur sélectionné.

source: You can remove access to this workspace by selecting ``Not shared`` for a given user.
fr: Vous pouvez supprimer l'accès à cet espace de travail en sélectionnant ``Non partagé`` pour un utilisateur donné.

source: Workspace roles
fr: Rôles des espaces de travail

source: The **workspace role** defines what the user is allowed to do within the workspace. Since the role is specific to the workspace, a user can have different roles in different workspaces.
fr: Le **rôle de l'espace de travail** définit ce que l'utilisateur est autorisé à faire dans l'espace de travail. Comme le rôle est spécifique à l'espace de travail, un utilisateur peut avoir différents rôles dans différents espaces de travail.

source: The available roles and what they allow to do are shown in the following table.
fr: Les rôles disponibles et ce qu'ils permettent de faire sont indiqués dans le tableau suivant.

source: User rights
fr: Droits de l'utilisateur

source: Reader
fr: Lecteur

source: Contributor
fr: Contributeur

source: Manager
fr: Gérant

source: Owner
fr: Propriétaire

source: Can view and open files
fr: Peut visualiser et ouvrir des fichiers

source: Can edit, import and delete files
fr: Peut modifier, importer et supprimer des fichiers

source: Can manage user access to the workspace
fr: Peut gérer l'accès des utilisateurs à l'espace de travail

source: Can re-encrypt the workspace
fr: Peut re-chiffrer l'espace de travail

source: Can promote other users to Owner
fr: Peut promouvoir d'autres utilisateurs en tant que Propriétaire

source: Users without a role in the workspace, are not allowed to access nor see the workspace.
fr: Les utilisateurs qui n'ont pas de rôle dans l'espace de travail ne sont pas autorisés à accéder à l'espace de travail ni à le voir.

source: It is recommended to always share the workspace with other users.
fr: Il est recommandé de toujours partager l'espace de travail avec d'autres utilisateurs.

source: Strong cryptographic security prevents data recovery. If the workspace is not shared with others, and the user loses access to its device or cannot log in for any reason, data stored in the workspace will be lost forever.
fr: La sécurité cryptographique forte empêche la récupération des données. Si l'espace de travail n'est pas partagé avec d'autres personnes et que l'utilisateur perd l'accès à son appareil ou ne peut pas se connecter pour une raison quelconque, les données stockées dans l'espace de travail seront perdues à jamais.

source: Copy user roles to another user
fr: Copier les rôles d'un utilisateur à un autre

source: You can assign the same roles to multiple users by copying roles from one user to another.
fr: Vous pouvez assigner plusieurs rôles à plusieurs utilisateurs en copiant les rôles de l'un vers l'autre.

source: As an example, Mallory is an intern in your company with whom you have shared 4 workspaces: 2 as a `Reader`, 2 as a `Contributor`. Bob is a newly hired intern, and you want to share the same workspaces (and roles) you shared with Mallory. Instead of sharing each workspace one by one, go to ``Manage my organization`` in the top left corner and access the list of users. Right-click on Mallory, and select ``Copy workspace roles to...``.
fr: En guise d'exemple, Mallory est stagiaire dans votre entreprise, et utilise Parsec. Vous lui avez partagé quatre espaces de travail, deux en tant que `Lecteur` et deux en tant que `Contributeur`. Bob est un nouveau stagiaire, et vous souhaitez lui partager les mêmes espaces que vous aviez partagés avec Mallory. Plutôt que de partager chaque espace l'un après l'autre, vous pouvez à la place aller dans ``Gérer mon organisation`` dans le coin supérieur gauche et accéder à la liste des utilisateurs. Faites un clic-droit sur Mallory, et sélectionnez ``Copier les rôles de espaces de travail à...``.

source: Batch workspace assignment screenshot
fr: Capture d'écran de l'affectation de masse des espaces

source: A dialog opens, asking you to select the target user to copy the roles to. Simply start typing its name or email address, and select the desired user.
fr: Une fenêtre s'ouvre, vous proposant de sélectionner un utilisateur à qui copier les rôles. Entrez les premières lettres de leur nom ou adresse email et sélectionnez l'utilisateur voulu.

source: Batch workspace select user screenshot
fr: Capture d'écran de la sélection d'utilisateur

source: Parsec displays the list of role changes that will be applied to the selected user. If satisfied with the changes, click on ``Copy roles``.
fr: Parsec vous informe des changements qui seront opérés. Si vous êtes satisfait, cliquez sur ``Copier les roles``.

source: A few things to note:
fr: Quelques détails à prendre en compte :

source: A user with an `External` profile cannot be have the `Manager` or `Owner` role in a workspace.
fr: Un utilisateur avec un profil `Externe` ne peut pas être `Gestionnaire` ou `Propriétaire` sur un espace.

source: If the target user already has a higher role on the workspace, it will not be changed.
fr: Si l'utilisateur ciblé possède déjà un rôle plus élevé sur l'espace de travail, il ne sera pas changé.

source: It will not change the roles the target user may have on other workspaces that are not shared with the source user.
fr: Les rôles sur les espaces qui ne sont pas partagé avec l'utilisateur pris comme source ne seront pas modifiés.

source: Only workspaces both you and the source have access to will be changed.
fr: Seuls les espaces que vous et l'utilisateur source avaient en commun seront pris en compte.

source: Only the workspaces where you are either `Manager` or `Owner` will be considered.
fr: Seuls les espaces sur lesquels vous êtes `Gestionnaire` ou `Propriétaire` seront pris en compte.

source: Browse workspace history and restore files
fr: Explorer l'historique d'un espace de travail et restaurer des fichiers

source: Parsec allows you to browse a workspace at a given time, showing you all the files as they were. You will need to have the **Owner** or **Manager** roles on the workspace. The ``History`` option is available in the workspace context menu.
fr: Parsec vous permet d'explorer un espace de travail à n'importe quel moment dans le temps, en affichant les fichiers tels qu'ils étaient. Vous devez être **Propriétaire** or **Gérant** de l'espace. ``Historique des versions`` est disponible dans le menu contextuel de l'espace de travail.

source: Browse workspace history
fr: Explorer l'historique d'un espace de travail

source: Once you enter the History mode, you can navigate inside the workspace as you normally would.
fr: Dans le mode Historique, vous pouvez naviguer normalement dans l'espace de travail.

source: Workspace history
fr: Historique de l'espaces de travail

source: If you change the date or time, files and folders will be automatically updated to reflect the state of the workspace at this moment. You can only select a time between the workspace's creation date and the current date.
fr: Si vous modifiez la date ou l'heure, les fichiers et les dossiers seront automatiquement mis à jour pour refléter leur état à l'instant choisi. Vous ne pouvez que sélectionner une date et une heure entre la date de création de l'espace et maintenant.

source: Select a date and time
fr: Choisissez une date et une heure

source: If you want to restore a file or a folder, select it and click ``Restore``. This will replace the current version of the file with the version from the selected date and time.
fr: Si vous souhaitez restorer un fichier ou un dossier, vous pouvez le sélectionner et cliquer sur ``Restaurer``. La version actuelle du fichier sera remplacée par la version choisie.

source: Restore a file
fr: Restaurer un fichier

source: If you make a mistake, don't worry, the file history is incremental and therefore it is never deleted! Let's take an example with a file named **File.txt** whose content has been updated as follows:
fr: Si vous faites une erreur, aucun soucis, l'historique du fichier n'est pas supprimé !Prenons en exemple un fichier nommé **Fichier.txt** dont le contenu a été mis à jour comme suit :

source: On April 1st, **Creation** of the file with the content **AAA**. This is **version 1**.
fr: Le 1er avril, **Création** du fichier avec le contenu **AAA**. Il s'agit de la **version 1**.

source: On April 5th, **Update** of the file with the content **BBB** (replacing the previous content). This is **version 2**.
fr: Le 5 avril, **Mise à jour** du fichier avec le contenu **BBB** (remplaçant le contenu précédent). Il s'agit de la **version 2**.

source: On April 7th, **Update** of the file with the content **CCC** (replacing the previous content). This is **version 3**.
fr: Le 7 avril, **Mise à jour** du fichier avec le contenu **CCC** (remplaçant le contenu précédent). Il s'agit de la **version 3**.

source: If you look at this workspace history on April 6th, the content of the file will be **BBB**. Should you chose to restore this version, the content of **File.txt** (**CCC** currently) will be replaced by **BBB**. This will be **version 4**, which means that **version 3** has not been deleted, and if you later change your mind, you will still be able to restore it.
fr: Si l'on observe l'historique de cet espace le 6 avril, le contenu du fichier sera **BBB**. Si vous choisissez de restaurer cette version, le contenu de **Fichier.txt** (**CCC** actuellement) sera remplacé par **BBB**. Il s'agira de la **version 4**, ce qui signifie que la **version 3** n'a pas été supprimée, et si vous changez d'avis plus tard, vous serez capable de la restaurer.

source: You can also explore the workspace history from a specific file. This will open the history page directly where the file is stored.
fr: Vous pouvez également explorer l'historique d'un espace depuis un fichier spécifique. L'historique sera ouvert directement au bon chemin.

source: Open workspace history from a file
fr: Ouvrir l'historique de l'espace de travail depuis un fichier
