Repository: Scille/parsec-cloud
Catalog: docs/locale/*/LC_MESSAGES/userguide/recovery_device.po
Languages: fr

source: Create and use a recovery device
fr: Créer et utiliser un appareil de récupération

source: A *recovery device* is a backup of an existing device. If you lose access to a Parsec's device (you forget the password, the Parsec keys had been lost, etc.), the recovery device will allow you to recreate a new device and set a new password.
fr: Un *appareil de récupération* est une sauvegarde d'un appareil existant. Si vous perdez l'accès à un appareil Parsec (vous avez oublié votre mots de passe, les clés de Parsec ont été perdu, etc.), L'appareil de récupération vous permet de recréer un nouvel appareil avec un nouveau mot de passe.

source: In order to `create a new recovery device`_ or to `use a recovery device`_ you need to open the recovery device dialog from the main menu:
fr: Pour pouvoir `créer un nouvel appareil de récupération`_ ou d'`utiliser un appareil de récupération`_ vous avez besoin d'ouvrir la boite dialogue de récupération d'appareil dans le menu principal:

source: Open the ``Recovery device`` menu.
fr: Ouvrir le menu ``Récupération d'appareils``.

source: You need to open the sub-menu then click on ``Recovery device`` option (alternatively, you can use the shortcut ``Ctrl+I``).
fr: Vous avez besoin d'ouvrir le sous-menu puis cliquer sur ``récupération d'appareil`` (vous pouvez également utiliser le raccourci ``Ctrl+I``).

source: Parsec menu with recovery device option highlighted
fr: Le menu Parsec avec l'option récupération d'appareil surligné

source: That will open a modal dialog that looks like this:
fr: La boite de dialogue suivant apparaît alors:

source: Parsec recovery device modal
fr: Boite de dialogue Parsec pour la récupération d'appareil

source: Create a new recovery device
fr: Créer un nouvel appareil de récupération

source: In the Device recovery dialog, select ``Create a recovery device``
fr: Dans la boite de dialogue de récupération d'appareil, sélectionner ``Créer un appareil de récupération``

source: From here:
fr: À partir de là:

source: Select the device you would like to create a recovery device for.
fr: Sélectionner l'appareil à partir duquel vous voulez créer un appareil de récupération.

source: Click the ``Select`` button to specify a file to store the recovery device.
fr: Cliquer sur le bouton ``Choisir`` pour spécifier le fichier où sera sauvegardé l'appareil de récupération.

source: Create a recovery device modal
fr: Boite de dialogue de création d'un appareil de récupération

source: Click ``Next``, you will be prompted to enter the password for the device you have selected
fr: Cliquer sur ``Suivant``, puis entrer le mot de passe pour l'appareil que vous avez sélectionné

source: Create a recovery device authentication modal
fr: Boite de dialogue d'authentification pour la création d'un appareil de récupération

source: After confirmation, the recovery file is created and a passphrase is displayed. **You need to save the passphrase** as it will not be displayed again.
fr: Après confirmation, le fichier de récupération est créé et la phrase secrète est affichée. **Vous avez besoin de sauvegarder la phrase secrète** car c'est la seule fois qu'elle sera affichée.

source: Create a recovery device confirmation modal
fr: Boite de dialogue confirmant la création d'un appareil de récupération

source: The passphrase should be handled carefully like any other password.
fr: La phrase secrète doit être manipulée comme n'importe quel mot de passe.

source: You can print out the passphrase and put-it in a safe to secure it. Nevertheless, you should not save it alongside the recovery file.
fr: Vous pouvez imprimer la phrase secrète et la mettre dans un coffre-fort pour la sécuriser. Néanmoins, vous ne devez pas la sauvegarder à coté du fichier de récupération.

source: Use a recovery device
fr: Utiliser un appareil de récupération

source: In the Device recovery dialog, select ``Recover a Device``
fr: Dans la boite de dialogue de récupération d'appareil, sélectionner ``Récupérer un appareil``

source: Select the recovery file of the device you want to recover.
fr: Sélectionner le fichier de récupération de l'appareil que vous voulez récupérer.

source: Enter the passphrase for the recovery device.
fr: Entrer la phrase secrète de l'appareil de récupération.

source: Enter the name of the new device.
fr: Entrer le nom du nouvel appareil.

source: Recover a device modal
fr: Boite de dialogue pour récupérer un appareil

source: Click ``Next``, you will be prompted to enter a new password and confirm it.
fr: Cliquer sur ``Suivant``, puis entrer un nouveau mot de passe et de le confirmer.

source: Enter the new password for the recovered device modal
fr: Boite de dialogue de configuration du nouveau mot de passe pour l'appareil récupéré

source: A message is displayed to confirm the device has been recovered, you can click ``Continue``.
fr: Un message est affiché pour confirmer que l'appareil a été récupéré

source: Device recovered confirmation modal
fr: Boite de dialogue confirmant la récupération de l'appareil

source: You can now access Parsec as usual using the new recovered device from the devices' list
fr: Vous pouvez maintenant accéder à Parsec comme d'habitude en utilisant le nouvel appareil depuis la liste des appareils
