Repository: Scille/parsec-cloud
Catalog: docs/locale/*/LC_MESSAGES/userguide/revoke_user.po
Languages: fr

source: Revoking users
fr: Révoquer des utilisateurs

source: Revoking a user is the operation that aims at removing his access rights to the organization. This is needed when:
fr: Révoquer un utilisateur est une opération visant à supprimer ses droits d'accès à l'organisation. Cela est requis quand:

source: the user is no longer needed (e.g. a person leaving his company)
fr: l'utilisateur n'a plus besoin de cet accès (par exemple dans le cas d'une personne changeant d'entreprise)

source: the user has been compromised
fr: l'utilisateur a été compromis

source: It is not possible to revoke a single device, only the entire user can be revoked. This is intended because the compromised device has the knowledge of some cryptographic secrets shared among all user's devices.
fr: Il n'y a pas moyen de révoquer un seul appareil, seul l'utilisateur entier peut être révoqué. Il s'agit d'un comportement voulu car un appareil compromis a connaissance des secret cryptographiques partagés entres les appareils de l'utilisateur.

source: Revocation
fr: Révocation

source: Revocation is done from the client, this option is accessible by right-clicking on a user:
fr: La révocation se fait depuis le client, cette option apparaît après un clic droit sur un utilisateur :

source: Revoking user process
fr: Processus de révocation des utilisateurs

source: Only an administrator of the organization can revoke a user
fr: Seul un administrateur de l'organisation peut révoquer un utilisateur

source: Revocation is irreversible!
fr: Révoquer un utilisateur est irréversible !

source: Workspace re-encryption
fr: Rechiffrer un espace de travail

source: Once a user is revoked, its devices are no longer allowed to connect to the Parsec server hosting the organization. In practice, this means the user won't be able to make any changes or consult the data he had access to.
fr: Une fois un utilisateur révoqué, ses appareils ne sont plus autorisés à se connecter au serveur Parsec hébergeant son organisation. En pratique cela veut dire que l'utilisateur est dans l'incapacité de modifier ou consulter les données qui étaient partagées avec lui.

source: However, from a cryptographic point of view, the revoked user still knows the encryption keys of the workspaces that have been shared with them. For this reason, those workspaces must be re-encrypted to ensure data security.
fr: Toutefois d'un point de vu cryptographique, l'utilisateur a toujours connaissance des clés de chiffrement des espaces de travail dont il avait accès. Pour cette raison ces espaces de travail doivent être re-chiffrés afin d'assurer la sécurité des données.

source: Once a user is revoked, each owner of a previously shared workspace will be notified that a re-encryption operation is required. Owners can then perform re-encryption right away or wait to do it later (for example if multiple user are getting revoked in one batch).
fr: Concrètement, cela signifie qu'une fois un utilisateur révoqué, chaque propriétaire d'un espace de travail ayant été partagé se voit notifié qu'une opération de re-chiffrement est nécessaire. À partir de ce moment, chaque propriétaire peut décider de réaliser l'opération ou bien d'attendre un meilleur moment (par exemple si plusieurs utilisateurs sont révoqués d'un coup).

source: Workspace re-encryption process
fr: Processus de re-chiffrement d'un espace de travail

source: During re-encryption, a workspace cannot be synchronized
fr: Pendant le re-chiffrement, un espace de travail ne peut pas être synchronisé

source: Re-encryption is fairly quick since only metadata are re-encrypted
fr: L'opération de re-chiffrement est très rapide car seules les méta-données sont re-chiffrées
