Repository: Scille/parsec-cloud
Catalog: docs/locale/*/LC_MESSAGES/userguide/share_data.po
Languages: fr

source: Share data
fr: Partage des données

source: Create & share workspace
fr: Créer et partager un espace de travail

source: In Parsec, data are stored into workspaces, each workspace having its own policy for read and write access.
fr: Dans Parsec, les données sont stockées dans des espaces de travail, chacun ayant ses propres règles d'accès en lecture et écriture.

source: So before adding data to Parsec we must create a workspace:
fr: De fait, avant de pouvoir ajouter des données dans Parsec il faut créer un espace de travail:

source: Creating workspace process
fr: Processus de création d'un espace de travail

source: The creator of the workspace automatically gets the ``Owner`` role, as shown above, and can then share the workspace with other users.
fr: Comme montré plus haut, le créateur de l'espace de travail obtient automatiquement le rôle ``Propriétaire`` et peut aussitôt partager l'espace de travail avec d'autres utilisateurs.

source: Sharing workspace process
fr: Processus de partage d'un espace de travail

source: Regarding the different sharing roles:
fr: Concernant les différents rôles de partage disponibles :

source: Reader: has read-only access to the workspace
fr: Lecteur: a un accès en lecture seule sur l'espace de travail

source: Contributor: has read and write access
fr: Contributeur : a un accès en lecture et écriture

source: Manager: same as Contributor and can also Reader and Contributor roles to other users.
fr: Gérant : comme le Contributeur, mais en plus donner les rôles Lecteur et Contributeur à d'autres utilisateurs.

source: Owner: same as Manager and can also give Manager and Owner roles to other users. In addition to this, Owners are responsible for maintenance tasks such as :ref:`workspace re-encryption <doc_userguide_revoke_user_workspace_re_encryption>`.
fr: Propriétaire : comme Gérant, mais peut aussi donner les rôles Gérant et Propriétaire à d'autres utilisateurs. En plus de cela, les Propriétaires sont responsable des opérations de maintenance comme le :ref:`re-chiffrement de l'espace de travail <doc_userguide_revoke_user_workspace_re_encryption>`.

source: Just like a user with a single device is bad because there is no fall-back if something happens to it, having a workspace with a single user is dangerous.
fr: De la même façon qu'un utilisateur avec un seul terminal est une mauvaise idée car il ne dispose pas de moyen de récupération en cas de problème, avoir un espace de travail contenant un seul utilisateur est dangereux.

source: Strong cryptographic security prevent data recovery if the user is lost or cannot log in. For this reason it is better to share the workspace with other users.
fr: Le chiffrement des données empêche toute récupération si cet utilisateur n'est plus en mesure de se connecter au système. Pour cette raison il est recommandé de partage l'espace de travail avec d'autres utilisateurs.

source: Upload data
fr: Importer des données

source: Once the workspace is created, it appears in the file explorer as a regular folder.
fr: Une fois l'espace de travail créé, il apparait dans l'explorateur de fichiers comme un répertoire classique.

source: Although workspaces are mounted by default, they can be unmounted or mounted back using the toggle at the bottom left of the workspace card. When a workspace is unmounted, his data are not accessible in Parsec, and it is not reachable through the regular file explorer of the computer.
fr: Bien que les Espaces de Travail soient montés par défaut, ils peuvent être démontés ou remontés en utilisant le bouton en bas à gauche de chaque carte d'Espace de Travail. Quand un Espace de Travail est démonté, ses données ne sont pas accessibles dans Parsec, et il n'est pas non plus accessible dans l'explorateur de fichier par défaut de l'appareil.

source: workspaces unmounted and mounted
fr: espaces de travail démontés et montés

source: Parsec also proposes its own file manager, accessible when clicking on a mounted workspace.
fr: Parsec propose aussi son propre explorateur de fichier, accessible par un clic sur un Espace de Travail monté.

source: Parsec in file explorer
fr: Parsec dans l'explorateur de fichiers

source: Data copied from file explorer also appear in the Parsec client. In addition, the Parsec client also displays the current synchronization state of each file (showing whether the modifications are only present locally or they have been synced with the server and hence are visible by everyone with access to the workspace).
fr: Les données copiées depuis l'explorateur de fichiers apparaissent dans le client Parsec. En plus de ça le client Parsec affiche aussi l'état de la synchronisation de chaque fichier (c'est à dire si les modifications d'un fichier sont présentent uniquement en local ou bien si elles ont été synchronisées avec le serveur Parsec et sont donc visibles par les autres utilisateurs ayant accès à l'espace de travail).

source: Parsec client can work while offline (however only data present locally are available), synchronization will occur automatically as soon as the connection with the server is established.
fr: Le client Parsec est capable de fonctionner sans connexion internet (toutefois seules les données présentent localement sont disponibles), la synchronisation se faisant automatiquement dès que la connexion avec le serveur Parsec est de nouveau disponible.

source: Bulk assign workspace roles to users
fr: Assigner plusieurs rôles en une fois

source: Manually assigning the same workspace roles to multiple users can be a bit tedious and error prone. Parsec provides a way to bulk assign the roles from one user to another.
fr: L'assignation manuelle des mêmes rôles d'espace de travail à plusieurs utilisateurs peut s'avérer fastidieuse et source d'erreurs. Parsec propose un moyen d'attribuer en bloc les rôles d'un utilisateur à un autre.

source: In the Users page, right click on the user you want to copy the roles from:
fr: Dans la page des utilisateurs, clic droit sur l'utilisateur dont vous voulez copier les rôles :

source: Start a bulk assignement
fr: Démarrez un assignement en gros

source: Search the user you want to assign the roles to:
fr: Recherchez l'utilisateur à qui assigner les rôles

source: Select the user to assign roles to
fr: Sélectionnez l'utilisateur à qui assigner les rôles

source: You're shown a summary of which roles are going to be assigned on each workspace. Click on `Assign roles` to complete the operation.
fr: Vous obtiendrez un récapitulatif des rôles qui seront assignés sur chaque espace de travail. Cliquez sur `Assignez les rôles` pour terminer l'opération.

source: Bulk assignment summary
fr: Assignment en gros

source: You can only assign roles on a workspace where you have an Owner or Manager role
fr: Vous ne pouvez assigner des rôles que sur les espaces de travail dont vous êtes Gérant ou Propriétaire

source: An Outsider user cannot have a role higher than Contributor
fr: Les externes ne peuvent pas avoir un rôle plus haut que Contributeur

source: You cannot assign roles higher than your own. If you have the Manager role in a workspace and you're trying to assign the Owner role, it will be downgraded to Contributor).
fr: Les rôles assignés peuvent être diminués si votre propre rôle sur l'espace de travail n'est pas assez haut. (si vous êtes Gérant et que vous essayez d'assigner un Propriétaire, il sera diminué vers Contributeur)

source: If the user already has a higher role on the workspace than the one you're trying to assign, no change will be made to its role
fr: Si un utilisateur a un rôle sur l'espace de travail plus haut que celui que vous souhaitez assigner, rien ne sera fait

source: The option is only available if you have workspaces in common with the source user and you have a role high enough
fr: Cette option est seulement disponible si vous avez un espace de travail en commun avec l'utilisateur source et que votre rôle est suffisamment haut
