Repository: Scille/parsec-cloud
Catalog: docs/locale/*/LC_MESSAGES/userguide/troubleshooting.po
Languages: fr

source: Troubleshooting
fr: Résolution des problèmes

source: MacOS Finder errors
fr: Erreurs du Finder macOS

source: Some file operations can fail when browsing your files through the macOS Finder. This is due to some macOS system updates that may break compatibility with the filesystem driver used by Parsec.
fr: Certaines opérations sur les fichiers peuvent échouer lorsque vous parcourez vos fichiers dans le Finder de macOS. Ceci est dû à certaines mises à jour du système macOS qui peuvent rompre la compatibilité avec le pilote du système de fichiers utilisé par Parsec.

source: Make sure your version of **macFUSE** is up to date, either by checking in `System Settings > macFUSE`, or through the `macFUSE <https://osxfuse.github.io/>`_ website. After update, you will need to allow the use of **macFUSE** in `System Settings > Privacy and Security` and reboot your Mac.
fr: Assurez-vous que votre version de **macFUSE** est à jour, soit en vérifiant dans `Réglages Système > macFUSE`, soit en consultant le site web `macFUSE <https://osxfuse.github.io/>`_. Après la mise à jour, vous devrez autoriser l'utilisation de **macFUSE** dans `Réglages Système > Confidentialité et sécurité` et redémarrer votre Mac.

source: If the issues persist on the latest version, you can still perform file operations directly in Parsec until the issue is fixed.
fr: Si les problèmes persistent dans la dernière version, vous pouvez toujours effectuer des opérations sur les fichiers directement dans Parsec jusqu'à ce que le problème soit résolu.

source: The Parsec interface (GUI) allows you to:
fr: L'interface Parsec (GUI) vous permet de :

source: **copy** and **move** files within the same workspace
fr: **copier** et **déplacer** des fichiers dans le même espace de travail

source: **delete** and **rename** files from your workspace
fr: **supprimer** et **renommer** les fichiers de votre espace de travail

source: **import** files into your workspace either:
fr: **importer** des fichiers dans votre espace de travail soit :

source: by drag & drop from the Finder into a directory in Parsec
fr: par glisser-déposer depuis le Finder dans un répertoire de Parsec

source: by using the ``Import`` button
fr: en utilisant le bouton ``Importer``

source: Microsoft Excel/Word or similar software says the file name is too long
fr: MS Excel/Word ou un logiciel similaire indique que le nom du fichier est trop long

source: This error is due to Microsoft's `Maximum File Path Limitation <https://learn.microsoft.com/en-us/windows/win32/fileio/maximum-file-path-limitation>`_.
fr: Cette erreur est due à la `Limitation du Chemin d'Accès Maximal <https://learn.microsoft.com/en-us/windows/win32/fileio/maximum-file-path-limitation>`_ de Microsoft.

source: When you save or open a file, its path (including the file name) cannot exceeds 260 characters. This limitation includes 3 characters for the drive (i.e. `D:`), the characters in folder names, the backslash character between folders, and the characters in the file name.
fr: Lorsque vous enregistrez ou ouvrez un fichier, son chemin d'accès (y compris le nom du fichier) ne peut dépasser 260 caractères. Cette limite inclut 3 caractères pour le lecteur (c'est-à-dire « D:` »), les caractères des noms de dossiers, la barre oblique inverse entre les dossiers et les caractères du nom du fichier.

source: So the only solution is to rename the file or the folders containing it in order to have shorter path.
fr: La seule solution consiste donc à renommer le fichier ou les dossiers qui le contiennent afin de raccourcir le chemin d'accès.

source: Microsoft's article also mentions a more cumbersome approach by modifying a registry entry. This might work, but it has not been tested in Parsec.
fr: L'article de Microsoft mentionne également une approche plus lourde consistant à modifier une entrée du registre. Cette méthode pourrait fonctionner, mais elle n'a pas été testée dans Parsec.

source: Copying files from Parsec V2 takes a long time
fr: La copie des fichiers de Parsec V2 prend beaucoup de temps

source: When copying files from a mounted workspace in Parsec V2 the operation may take some time and the files may not be accessible to open them. After some time, files are copied and can be open normally.
fr: Lors de la copie de fichiers à partir d'un espace de travail monté dans Parsec V2, l'opération peut prendre un certain temps et les fichiers peuvent ne pas être accessibles pour les ouvrir. Après un certain temps, les fichiers sont copiés et peuvent être ouverts normalement.

source: This is most likely due to data is not being present locally in cache. Reading data when is not in cache is much slower than reading data from from a regular on-disk filesystem and performance is heavily dependent on your internet connection speed.
fr: Cela est probablement dû au fait que les données ne sont pas présentes localement dans le cache. La lecture de données qui ne sont pas dans le cache est beaucoup plus lente que la lecture de données à partir d'un système de fichiers sur disque ordinaire et les performances dépendent fortement de la vitesse de votre connexion internet.

source: Moreover, while the file is under copy, its displayed size only grows when a *flush* operation occurs. Flush are not explicitly issued by Parsec V2 and happen automatically when data written since previous flush is bigger than the blocksize of the file (i.e. 512KB).
fr: De plus, lorsque le fichier est en cours de copie, sa taille affichée n'augmente que lorsqu'une opération de *flush* se produit. Cette opération n'est pas explicitement lancée par Parsec V2 et se produit automatiquement lorsque les données écrites depuis le flush précédent sont plus grandes que la taille de bloc du fichier (c'est-à-dire 512 Ko).

source: So this explain why the file can appear with a size of 0 for some time: data is being downloaded into cache and then copied via occasional flush operations.
fr: Cela explique pourquoi le fichier peut apparaître avec une taille de 0 pendant un certain temps : les données sont téléchargées dans la mémoire cache, puis copiées par des opérations de vidage occasionnelles.

source: You could try enabling the off-line mode on Parsec V2 workspaces before copying large amount of files. In any case, you will need to wait for the copy to be fully finished to be able to open files.
fr: Vous pouvez essayer d'activer le mode off-line de Parsec V2 sur les espaces de travail avant de copier une grande quantité de fichiers. Dans tous les cas, vous devrez attendre que la copie soit complètement terminée pour pouvoir ouvrir les fichiers.
