Repository: Scille/parsec-cloud
Catalog: docs/locale/*/LC_MESSAGES/userguide/workspace_offline_mode.po
Languages: fr

source: Offline mode for Workspace
fr: Mode hors-ligne pour l'espace de travail

source: The offline mode allows you to access the workspace data even if you are not connected to the server.
fr: Le mode hors-ligne vous permet d'accéder aux données de l'espace de travail même si vous n'êtes pas connecté au serveur.

source: To enable or disable the offline mode, right-click on a workspace and select ``Manage offline availability`` from the context menu.
fr: Pour activer ou désactiver le mode hors-ligne, faites un clic droit sur un espace de travail et sélectionnez ``Configurer la disponibilité hors-ligne`` depuis le menu contextuel.

source: Workspace context menu
fr: Menu contextuel de l'espace de travail

source: From the dialog, enable or disable offline mode by clicking the toggle button ``Offline availability``.
fr: Depuis la boite de dialogue, activer ou désactiver le mode hors-ligne en cliquant sur le bouton ``Disponibilité hors-ligne``.

source: Offline mode is disabled:
fr: Mode hors-ligne désactivé

source: Offline mode disabled
fr: Mode hors-ligne désactivé

source: Offline mode is enabled:
fr: Mode hors-ligne activé

source: Offline mode enabled
fr: Mode hors-ligne activé

source: In both cases, the dialog displays the amount of data available locally and the total amount of data in the workspace.
fr: Dans les 2 cas, la boîte de dialogue affiche la quantité de données disponibles localement sur la quantité totale de l'espace de travail.
