Repository: Scille/parsec-cloud
Catalog: docs/locale/*/LC_MESSAGES/adminguide/freeze_users.po
Languages: fr

source: Freeze users
fr: Gel des utilisateurs

source: Server administrators can *freeze* users via the Administration API. A frozen user will be temporarily blocked from connecting to Parsec server.
fr: Les administrateurs du serveur peuvent *geler* les utilisateurs via l'API d'administration. Un utilisateur gelé sera temporairement empêché de se connecter au serveur Parsec.

source: This mechanism allows to automatically block users who have been deleted from a directory service (such as OpenLDAP or Active Directory), while waiting for the Organization administrator to revoke them. It is exposed in the form of HTTP routes that only requires an administration token.
fr: Ce mécanisme permet de bloquer automatiquement les utilisateurs qui ont été supprimés d'un service d'annuaire (comme OpenLDAP ou Active Directory), en attendant que l'administrateur de l'organisation les révoque. Il est exposé sous la forme de routes HTTP qui ne nécessitent qu'un jeton d'administration.

source: The *freeze* operation is performed by a *Server administrator* and can be undone. The *revoke* operation is performed by an *Organization administrator* and cannot be undone, it is the definitive removal of the user's rights within the organization.
fr: L'opération de *gel* est effectuée par un *administrateur du serveur* et est réversible. L'opération de *révocation* est effectuée par un *administrateur de l'organisation* et n'est pas réversible ; il s'agit de la suppression définitive des droits de l'utilisateur au sein de l'organisation.

source: HTTP ``/users`` route
fr: Route HTTP ``/users``

source: This route is made available as ``/administration/organizations/<raw_organization_id>/users`` and requires an administration token.
fr: Cette route est disponible sous ``administration/organisations/<raw_organization_id>/users`` et nécessite un jeton d'administration.

source: It supports the ``GET`` method which lists information for all users, including:
fr: Il prend en charge la méthode ``GET`` qui liste les informations relatives à tous les utilisateurs, y compris :

source: user name
fr: nom de l'utilisateur

source: user email
fr: adresse e-mail de l'utilisateur

source: frozen status
fr: statut de gel

source: Here's an example using ``curl`` and ``jq``:
fr: Voici un exemple utilisant ``curl`` et ``jq`` :

source: A successful request returns a JSON object with the following structure:
fr: Une requête réussie renvoie un objet JSON avec la structure suivante :

source: HTTP ``/users/freeze`` route
fr: Route HTTP ``/users/freeze``

source: This route is made available as ``/administration/organizations/<raw_organization_id>/users/freeze`` and requires an administration token.
fr: Cette route est disponible sous ``administration/organisations/<raw_organization_id>/users/freeze`` et nécessite un jeton d'administration.

source: It supports the ``POST`` method which modifies the ``frozen`` status for a given user.
fr: Il supporte la méthode ``POST`` qui modifie le statut ``frozen`` pour un utilisateur donné.

source: Here's an example of generating the request data using ``jq``:
fr: Voici un exemple de génération des données de la requête en utilisant ``jq`` :

source: The request can also use the ``user_email`` field instead of ``user_id`` to identify the Parsec user (see the :ref:`note on user identification <note-on-user-identification>` section below for more information):
fr: La requête peut également utiliser le champ ``user_email`` au lieu de ``user_id`` pour identifier l'utilisateur de Parsec (voir la section :ref:`note on user identification <note-on-user-identification>` ci-dessous pour plus d'informations) :

source: Here's an example of running the request using ``curl`` and ``jq``:
fr: Voici un exemple d'exécution de la requête en utilisant ``curl`` et ``jq`` :

source: A successful request returns a JSON dictionary similar to the one below:
fr: Une requête réussie renvoie un dictionnaire JSON similaire à celui ci-dessous :

source: HTTP Error handling
fr: Traitement des erreurs HTTP

source: The following errors can be returned by both ``/users`` and ``/users/freeze`` routes:
fr: Les erreurs suivantes peuvent être retournées par les routes ``/users`` et ``/users/freeze`` :

source: ``404: Organization not found`` with JSON body ``{"error": "not_found}``
fr: ``404: Organization not found`` avec JSON body ``{"error": "not_found}``

source: ``403: Invalid administration token`` with JSON body ``{"error": "not_allowed"}``
fr: ``403: Invalid administration token`` avec JSON body ``{"error": "not_allowed"}``

source: ``400: Wrong request format`` with JSON body ``{"error": "bad_data"}``
fr: ``400: Wrong request format`` avec JSON body ``{"error": "bad_data"}``

source: The following error is returned by the ``/users/freeze`` request if the user does not exist in the organization:
fr: L'erreur suivante est retournée par la requête ``/users/freeze`` si l'utilisateur n'existe pas dans l'organisation :

source: ``404: User not found`` with JSON body ``{"error": "user_not_found"}``
fr: ``404: User not found`` avec JSON body ``{"error": "user_not_found"}``

source: Note on user identification
fr: Note sur l'identification de l'utilisateur

source: There is a subtle difference between using **Parsec user ID** or **email address** to identify a user.
fr: Il existe une différence subtile entre l'utilisation de **l'ID utilisateur Parsec** ou de **l'adresse e-mail** pour identifier un utilisateur.

source: The **Parsec user ID** uniquely identifies a user *within the Parsec server*, regardless of its organization. When a user is revoked, its user ID identifies the revoked user.
fr: Le **user ID** identifie de manière unique un utilisateur *au sein du serveur Parsec*, quelle que soit son organisation. Lorsqu'un utilisateur est révoqué, son ID identifie l'utilisateur révoqué.

source: The **email address** identifies an active (i.e. non-revoked) user *within an organization*. When a user is revoked, its email address can be reused to (re)join the organization.
fr: L'**adresse électronique** identifie un utilisateur actif (c'est-à-dire non révoqué) *au sein d'une organisation*. Lorsqu'un utilisateur est révoqué, son adresse électronique peut être réutilisée pour rejoindre l'organisation.

source: This means that, over time, an email address can be shared between multiple user IDs, either from different organizations or within the same organization if it has been revoked.
fr: Cela signifie qu'au fil du temps, une adresse électronique peut être partagée entre plusieurs identifiants d'utilisateurs, qu'ils appartiennent à des organisations différentes ou à la même organisation s'ils ont été révoqués.

source: Consider the following scenario:
fr: Considérons le scénario suivant :

source: ID **1** alice@mail.com (**revoked**)
fr: ID **1** alice@mail.com (**révoqué**)

source: ID **4** bob@mail.com (**active**)
fr: ID **4** bob@mail.com (**actif**)

source: ID **2** bob@mail.com (**active**)
fr: ID **2** bob@mail.com (**actif**)

source: ID **5** alice@mail.com (**active**)
fr: ID **5** alice@mail.com (**actif**)

source: ID **3** alice@mail.com (**active**)
fr: ID **3** alice@mail.com (**actif**)

source: The frozen status specified in the ``POST`` request is always associated with a Parsec user ID, even if an email address is specified.
fr: Le statut *frozen* spécifié dans la requête ``POST`` est toujours associé à un ID d'utilisateur Parsec, même si une adresse e-mail est spécifiée.

source: Regarding the previous scenario, here are some possible requests and their outcomes: - Freeze user with ID **1**: will have no consequences since the user is already *revoked*. - Freeze user with ID **4**: will effectively freeze the user. Its *active* status is maintained in case of unfreeze. - Freeze user with email **alice@mail.com** from **Org 1**: will freeze user with ID **3** (user with ID **1** is not considered as it is already revoked)
fr: En ce qui concerne le scénario précédent, voici quelques requêtes possibles et leurs résultats : - Gel de l'utilisateur avec ID **1** : n'aura aucune conséquence puisque l'utilisateur est déjà *révoqué*. - Gel de l'utilisateur avec ID **4** : l'utilisateur sera effectivement gelé. Son statut *actif* est maintenu en cas de déblocage. - Gel de l'utilisateur avec l'email **alice@mail.com** dans **Org 1** : l'utilisateur avec l'ID **3** sera gelé (l'utilisateur avec ID **1** n'est pas pris en compte car déjà révoqué).

source: Notice that if a user is revoked from an organization and then re-invited with the same email address, its previous frozen status will **not** be applied to the new user.
fr: Notez que si un utilisateur est révoqué d'une organisation puis réinvité avec la même adresse électronique, son statut gelé antérieur **ne sera pas** appliqué au nouvel utilisateur.
